.ref-845a45a641b570c4164b05f649aca9a6fdddbe6e/usr/src/share/man/man8/man8.vax/drtest.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)drtest.8	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt DRTEST 8
.Os BSD 4.2
.Sh NAME
.Nm drtest
.Nd standalone disk test program
.Sh DESCRIPTION
.Nm Drtest
is a standalone program used to read a disk 
track by track. 
It was primarily intended as a test program 
for new standalone drivers, but has shown
useful in other contexts as well, such as 
verifying disks and running speed
tests. For example, when a disk has been formatted
(by
.Xr format 8 ) ,
you can check that
hard errors has been taken care of by running 
.Nm drtest .
No hard errors should be found, but in many cases 
quite a few soft
.Tn ECC
errors will be reported.
.Pp
While
.Nm drtest
is running, the cylinder number is printed on
the console for every 10th cylinder read.
.Sh EXAMPLE
A sample run of 
.Xr drtest
is shown below.  
In this example (using a 750), 
.Nm drtest
is loaded from the root file system;
usually it
will be loaded from the machine's
console storage device.  Boldface means user input.
As usual, ``#'' and ``@'' may be used to edit input.
.Pp
.Bd -unfilled -offset indent -compact
.Li \&>>> Ns Sy B/3
.Li \&%%
.Li \&loading hk(0,0)boot 
.Li \&Boot
.Li \&: Sy \&hk(0,0)drtest
.Li Test program for stand-alone up and hp driver

.Li Debugging level (1=bse, 2=ecc, 3=bse+ecc)?
.Li Enter disk name [type(adapter,unit),\ e.g.\ hp(1,3)]? Sy hp(0,0)
.Li Device data: #cylinders=1024, #tracks=16, #sectors=32
.Li Testing hp(0,0), chunk size is 16384 bytes.
.Em (chunk\ size\ is\ the\ number\ of\ bytes read per disk access)
.Li Start ...Make sure hp(0,0) is online
.Li \ ...
.Em (errors are reported as they occur)
.Li \ ...
.Em (...program restarts to allow checking other disks)
.Em (...to abort halt machine with \&^P)
.Ed
.Sh DIAGNOSTICS
The diagnostics are intended to be self explanatory. Note, however, that 
the device number
in the diagnostic messages is identified as
.Em typeX
instead of 
.Em type(a,u)
where
.Ar X
\&= a*8+u, e.g., hp(1,3) becomes hp11.
.Sh SEE ALSO
.Xr format 8 ,
.Xr bad144 8
.Sh AUTHOR
Helge Skrivervik
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
