usr/src/share/man/man4/man4.vax/dh.4
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)dh.4	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt DH 4 vax
.Os BSD 4
.Sh NAME
.Nm dh
.Nd
.Tn DH-11 Ns / Tn DM-11
multiplexer device interface
.Sh SYNOPSIS
.Cd "device dh0 at uba0 csr 0160020 vector dhrint dhxint" Op Ar flags
.Cd "device dm0 at uba0 csr 0170500 vector dmintr" Op Ar flags
.Sh DESCRIPTION
A
.Tn DH-11
provides 16 serial communication lines;
.Tn DM-11 Ns s
may optionally be
paired with
.Tn DH-11 Ns s
to provide modem control for the lines.
.Pp
An optional argument
.Ar flags
may be supplied with the device specification
in the
.Xr config 8
file indicating
that the line corresponding to
bit number
.Ar i
is not properly
connected, and should be treated as hard-wired with carrier
always present.  Thus specifying
.Ql flags 0x0004
for
.Li dh0
would cause line
.Pa ttyh2
to be treated in this way.
.Pp
Normal I/O
control parameters for individual lines are managed by
.Xr ioctl 2
calls.
Line speeds may be initiated via
.Xr getty 8
and
.Xr stty 1
or may be communicated by other programs which
utilize
.Xr ioctl
such as
.Xr ifcongif 8 ,
see
.Xr tty 4  .
.Pp
The
.Nm dh
driver monitors the rate of input on each board,
and switches between the use of character-at-a-time interrupts
and input silos.
While the silo is enabled during periods of high-speed input,
the driver polls for input 30 times per second.
.Sh FILES
.Bl -tag -width /dev/tty[h-o][0-9a-f]x -compact
.It Pa /dev/tty[h-o][0-9a-f]
.It Pa /dev/ttyd[0-9a-f]
.El
.Sh DIAGNOSTICS
.Bl -diag
.It dh%d: NXM.
No response from
.Tn UNIBUS
on a dma transfer
within a timeout period.  This is often followed by a
.Tn UNIBUS
adapter
error.  This occurs most frequently when the
.Tn UNIBUS
is heavily loaded
and when devices which hog the bus (such as
.Tn RK07 Ns s) are present.
It is not serious.
.Pp
.It dh%d: silo overflow.
The character input silo overflowed
before it could be serviced.  This can happen if a hard error occurs
when the
.Tn CPU
is running with elevated priority, as the system will
then print a message on the console with interrupts disabled.
It is not serious.
.El
.Sh SEE ALSO
.Xr tty 4
.Sh HISTORY
A
.Nm
driver appeared in
.At v6 .
