usr/src/share/man/man4/man4.vax/uu.4
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)uu.4	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt UU 4 vax
.Os BSD 4.2
.Sh NAME
.Nm uu
.Nd
.Tn TU58 Ns / Tn DECtape II UNIBUS
cassette interface 
.Sh SYNOPSIS
.Cd "options UUDMA"
.Cd "device uu0 at uba0 csr 0176500 vector uurintr uuxintr"
.Sh DESCRIPTION
The
.Nm uu
device provides access to dual
.Tn DEC
.Tn TU58
tape cartridge drives
connected to the
.Tn UNIBUS
via a
.Tn DL11-W
interface module.
.Pp
The interface supports only block
.Tn I/O
to the
.Tn TU58
cassettes (see
.Xr physio 4 ) .
The drives are normally manipulated with the
.Xr arff 8
program using the ``m'' and ``f'' options.
.Pp
The driver provides for an optional write and verify 
(read after write) mode that is activated by specifying the
``a'' device.
.Pp
The
.Tn TU58
is treated as a single device by the system even
though it has two separate drives,
.Sq Li uu0
and
.Sq Li uu1 .
If there is 
more than one
.Tn TU58
unit on a system, the extra drives
are named
.Sq Li uu2 ,
.Sq Li uu3
etc.
.Sh NOTES
Assembly language code to assist the driver in handling
the receipt of data (using a pseudo-dma approach) should
be included when using this driver; specify
.Sq Li options UUDMA
in the configuration file.
.Sh FILES
.Bl -tag -width /dev/uu?a -compact
.It Pa /dev/uu?
.It Pa /dev/uu?a
.El
.Sh DIAGNOSTICS
.Bl -diag
.It uu%d: no bp, active %d.
A transmission complete interrupt was received with no outstanding
.Tn I/O
request. This indicates a hardware problem.
.Pp
.It uu%d protocol error, state=%s, op=%x, cnt=%d, block=%d.
The driver entered an illegal state.  The information printed
indicates the illegal state, the 
operation currently being executed,
the
.Tn I/O
count, and the block number on the cassette.
.Pp
.It uu%d: break received, transfer restarted.
The
.Tn TU58
was sending a continuous break signal and had
to be reset. This may indicate a hardware problem, but
the driver will attempt to recover from the error.
.Pp
.It uu%d receive state error, state=%s, byte=%x.
The driver entered an illegal state in the receiver finite
state machine.  The state is shown along with the control
byte of the received packet.
.Pp
.It uu%d: read stalled.
A timer watching the controller detected no interrupt for
an extended period while an operation was outstanding.
This usually indicates that one or more receiver interrupts
were lost and the transfer is restarted.
.Pp
.It uu%d: hard error bn%d, pk_mod %o.
The device returned a status code indicating a hard error. The
actual error code is shown in octal. No retries are attempted
by the driver.
.El
.Sh ERRORS
The following errors may be returned:
.Bl -tag -width [ENXIO]
.It Bq Er ENXIO
Nonexistent drive (on open); 
offset is too large or bad (undefined)
.Xr ioctl 2
code.
.It Bq Er EIO
Open failed, the device could not be reset.
.It Bq Er EBUSY
Drive in use.
.El
.Sh SEE ALSO
.Xr tu 4 ,
.Xr arff 8
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.2 .
