.ref-26af45907971fe96fc69c497470a08ea8542e499/usr/src/sbin/badsect/badsect.8
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)badsect.8	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt BADSECT 8
.Os BSD 4
.Sh NAME
.Nm badsect
.Nd create files to contain bad sectors
.Sh SYNOPSIS
.Nm /etc/badsect
.Ar bbdir sector ...
.Sh DESCRIPTION
.Nm Badsect
makes a file to contain a bad sector.  Normally, bad sectors
are made inaccessible by the standard formatter, which provides
a forwarding table for bad sectors to the driver; see
.Xr bad144 8
for details.
If a driver supports the bad blocking standard it is much preferable to
use that method to isolate bad blocks, since the bad block forwarding
makes the pack appear perfect, and such packs can then be copied with
.Xr dd 1 .
The technique used by this program is also less general than
bad block forwarding, as
.Nm badsect
can't make amends for
bad blocks in the i-list of file systems or in swap areas.
.Pp
On some disks,
adding a sector which is suddenly bad to the bad sector table
currently requires the running of the standard
.Tn DEC
formatter.
Thus to deal with a newly bad block
or on disks where the drivers
do not support the bad-blocking standard 
.Nm badsect
may be used to good effect.
.Pp
.Nm Badsect
is used on a quiet file system in the following way:
First mount the file system, and change to its root directory.
Make a directory
.Li BAD
there.  Run
.Nm badsect
giving as argument the
.Ar BAD
directory followed by
all the bad sectors you wish to add.
(The sector numbers must be relative to the beginning of
the file system, but this is not hard as the system reports
relative sector numbers in its console error messages.)
Then change back to the root directory, unmount the file system
and run
.Xr fsck 8
on the file system.  The bad sectors should show up in two files
or in the bad sector files and the free list.  Have
.Xr fsck
remove files containing the offending bad sectors, but 
.Em do not
have it remove the
.Pa BAD/ Ns Em nnnnn
files.
This will leave the bad sectors in only the
.Li BAD
files.
.Pp
.Nm Badsect
works by giving the specified sector numbers in a
.Xr mknod 2
system call,
creating an illegal file whose first block address is the block containing
bad sector and whose name is the bad sector number.
When it is discovered by 
.Xr fsck
it will ask
.Dq Li "HOLD BAD BLOCK ?"
A positive response will cause 
.Xr fsck
to convert the inode to a regular file containing the bad block.
.Sh SEE ALSO
.Xr bad144 8 ,
.Xr fsck 8 ,
.Xr format 8
.Sh DIAGNOSTICS
.Nm Badsect
refuses to attach a block that
resides in a critical area or is out of range of the file system.
A warning is issued if the block is already in use.
.Sh BUGS
If more than one sector which comprise a file system fragment are bad,
you should specify only one of them to
.Nm badsect ,
as the blocks in the bad sector files actually cover all the sectors in a
file system fragment.
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.1 .
