.ref-BSD-4_4_Lite1/usr/src/share/man/man4/man4.tahoe/autoconf.4
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)autoconf.4	8.1 (Berkeley) 6/5/93
.\"
.Dd June 5, 1993
.Dt AUTOCONF 4 tahoe
.Os BSD 4.3t
.Sh NAME
.Nm autoconf
.Nd diagnostics from autoconfiguration code
.Sh DESCRIPTION
When
.Tn UNIX
bootstraps it probes the innards of the machine it is running
on and locates controllers, drives, and other devices, printing out
what it finds on the console.  This procedure is driven by a system
configuration table which is processed by
.Xr config 8
and compiled into each kernel.
.Pp
.Tn VERSAbus
devices are located by probing to see if their control-status
registers respond.  If not, they are silently ignored.  If the control
status register responds but the device cannot be made to interrupt,
a diagnostic warning will be printed on the console and the device
will not be available to the system.
.Pp
A generic system may be built which picks its root device at boot time
as the
.Dq best
available device.
If such a system is booted with the
.Dv RB_ASKNAME
option of (see
.Xr reboot 2 ) ,
then the name of the root device is read from the console terminal at boot
time, and any available device may be used.
.Sh DIAGNOSTICS
.Bl -diag
.It vba%d at %x.
A
.Tn VERSAbus
adapter was found and mapped into the
address space of the operating system starting at virtual address
.Sq Li  %x .
.Tn UNIX
will call it
.Sq Li vba%d .
.It %s%d at vba%d drive %d.
A tape formatter or a disk was found
on the
.Tn VERSAbus ;
for disks
.Sq Li %s%d
will look like
.Sq Li dk0 ,
for tape formatters
like
.Sq Li yc1 .
The drive number comes from the unit plug on the drive
or in the tape formatter
.Pf ( Em not
on the tape drive; see below).
.It %s%d at %s%d slave %d.
Which would look like
.Sq Li yc0 at cy0 slave 0% ,
where
.Em yc0
is the name for the tape device and
.Em cy0
is the name
for the formatter.  A tape slave was found on the tape formatter at the
indicated drive number (on the front of the tape drive).
.Tn UNIX
will call the device, e.g.,
.Li cy0.
.It %s%d at vba%d csr %x vec %x ipl %x.
The device
.Sq Li %s%d ,
e.g.
.Sq Li vd0
was found on
.Sq Li vba%d
at control-status register address
.Sq Li %x
and with
device vector
.Sq Li %x .
The device interrupted at priority level
.Sq Li %x .
.It %s%d at vba%d csr %x no interrupts.
The device was found
on
.Sq Li vba%d
at control-status register address
.Sq Li %x ;
no
interrupts were configured for the device.
.It %s%d at vba%d csr %x didn't interrupt.
The device did not interrupt,
likely because it is broken, hung, or not the kind of device it is advertised
to be.  The csr address is interpreted as described above.
.It %s%d at %s%d slave %d.
Which would look like
.Sq Li dk0 at vd0 slave 0 ,
where
.Em dk0
is the name of a disk drive and
.Em vd0
is the name
of the controller. 
.El
.Sh SEE ALSO
.Xr config 8
.Sh HISTORY
The
.Nm
special file appeared in
.Bx 4.3 tahoe .
.Sh BUGS
Very few devices actually figure out their interrupt vector
by forcing the device to interrupt.  Only the upper megabyte of the
.Tn VERSAbus
address space is mapped into the system's virtual address space.
