.ref-BSD-4_4_Lite1/usr/src/share/man/man4/man4.tahoe/cons.4
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)cons.4	8.1 (Berkeley) 6/5/93
.\"
.Dd June 5, 1993
.Dt CONS 4 tahoe
.Os BSD 4.3t
.Sh NAME
.Nm cons ,
.Nm CP ,
.Nm remote
.Nd Tahoe console interface
.Sh DESCRIPTION
The console is available to the processor through the console registers.
It acts like a normal terminal, except that a
.Dq Ic ~
is used to transfer
commands to the console processor when the front panel key switch is
in the
.Dq foo
or
.Dq bar
position.
When the console processor
is in control, a
.Ql #>
prompt is displayed.  To continue execution
after halting the machine with
.Ql ~h ,
use
.Ql r .
.Bl -tag -width Ds
.It Ic \&~h
Halt the machine.
.It Ic \&~b
Force a reboot.
.It Ic \&~r
Continue execution after a
.Ic \&~h .
.El
.Pp
Refer to the Tahoe
console processor handbook for the complete list of facilities available
through the console processor.
.Pp
The
.Nm CP
device provides direct access to the console processor.  The
.Nm remote
device is a secondary console terminal used for remote diagnosis;
it is normally connected to a modem.
.Sh FILES
.Bl -tag -width /dev/consolexx -compact
.It Pa /dev/console
.It Pa /dev/CP
.It Pa /dev/remote
.El
.Sh DIAGNOSTICS
None.
.Sh SEE ALSO
.Xr kdb 4 ,
.Xr tty 4 ,
.Xr reboot 8
.Rs
.%T Console Processor Handbook
.Re
.Sh HISTORY
The
.Nm
interface appeared in
.Bx 4.3 tahoe .
