.ref-BSD-4_4/usr/src/usr.bin/uucp/uuxqt/uuxqt.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)uuxqt.8	8.1 (Berkeley) 6/6/93
.\"
.Dd June 6, 1993
.Dt UUXQT 8
.Os BSD 4.3
.Sh NAME
.Nm uuxqt
.Nd
.Tn UUCP
execution file interpreter
.Sh SYNOPSIS
.Nm uuxqt
.Op Fl x Ar debug
.Sh DESCRIPTION
.Nm Uuxqt
interprets
.Em execution files
created on a remote system via
.Xr uux 1
and transferred to the local system via
.Xr uucico 8 .
When a user uses
.Xr uux
to request remote command execution, it is
.Nm uuxqt
that actually executes the command. 
.Pp
Option availble:
.Bl -tag -width Ar
.It Fl x Ns Ar debug
Normally,
.Nm uuxqt
is forked from
.Xr uucico 8
to process queued execution files;
for debugging, it may also be run manually by the
.Tn UUCP
administrator.
.El
.Pp
.Nm Uuxqt
runs in its own subdirectory
.Pa /var/spool/uucp/XTMP .
It copies intermediate files to this directory when necessary.
.Sh FILES
.Bl -tag -width /var/spool/uucp/LCK/LCK.XQT -compact
.It Pa /usr/lib/uucp/L.cmds
Remote command permissions list
.It Pa /usr/lib/uucp/USERFILE
Remote directory tree permissions list
.It Pa /var/spool/uucp/LOGFILE
.Tn UUCP
system activity log
.It Pa /var/spool/uucp/LCK/LCK.XQT
.Nm Uuxqt
lock file
.It Pa /var/spool/uucp/X./
Incoming execution file directory
.It Pa /var/spool/uucp/XTMP
.Nm Uuxqt
running directory
.El
.Sh SEE ALSO
.Xr uucp 1 ,
.Xr uux 1 ,
.Xr L.cmds 5 ,
.Xr USERFILE 5 ,
.Xr uucico 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.3 .
