.ref-BSD-4_4/usr/src/old/enpload/enpload.8
.\" Copyright (c) 1987, 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Computer Consoles Inc.
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)enpload.8	5.4 (Berkeley) 3/16/91
.\"
.Dd March 16, 1991
.Dt ENPLOAD 8
.Os BSD 4.2
.Sh NAME
.Nm enpload
.Nd download firmware and initialize a
.Tn CMC
Ethernet controller
.Sh SYOPNSIS
.Nm enpload
.Ar device
.Op Ar files
.Sh DESCRIPTION
.Nm Enpload
is used to download firmware and initialize a
.Tn CMC ENP-20
Ethernet controller.
.Pp
Operands available:
.Bl -tag -width Fl
.It Ar device
The
.Ar device
specified is a character device used to access the on-board
.Tn RAM
which hosts the controllers operating firmware;
.It Ar files
The
.Ar files
arguments specify the firmware file(s) to load into this memory.
After
.Nm enpload
deposits the specified firmware it starts the board running.
.El
.Pp
If no firmware is specified the board is just restarted.
.Nm Enpload
must be run before a
.Tn CMC
controller can be used by the
system.
.Sh FILES
.Bl -tag -width /dev/enp?ram -compact
.It Pa /dev/enp?ram
special files for accessing
.Tn ENP-20
memory
.It Pa /etc/enpcode
link-level firmware
.El
.Sh SEE ALSO
.Xr enp 4 ,
.Xr ifconfig 8 ,
.Xr rc 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.3 tahoe .
