.ref-BSD-4_3_Reno/usr/src/share/man/man7/hostname.7
.\" Copyright (c) 1987, 1990 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms are permitted provided
.\" that: (1) source distributions retain this entire copyright notice and
.\" comment, and (2) distributions including binaries display the following
.\" acknowledgement:  ``This product includes software developed by the
.\" University of California, Berkeley and its contributors'' in the
.\" documentation or other materials provided with the distribution and in
.\" all advertising materials mentioning features or use of this software.
.\" Neither the name of the University nor the names of its contributors may
.\" be used to endorse or promote products derived from this software without
.\" specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR IMPLIED
.\" WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\"
.\"     @(#)hostname.7	6.5 (Berkeley) 6/24/90
.\"
.Dd June 24, 1990
.Dt HOSTNAME 7
.Os BSD 4.2
.Sh NAME
.Nm hostname
.Nd host name resolution description
.Sh DESCRIPTION
Hostnames are domains, where a domain is a hierarchical, dot-separated
list of subdomains; for example, the machine monet, in the Berkeley
subdomain of the EDU subdomain of the Internet would be represented as
.Pp
.Dl monet.Berkeley.EDU
.Pp
(with no trailing dot).
.Pp
Hostnames are often used with network client and server programs,
which must generally translate the name to an address for use.
(This function is generally performed by the library routine
.Xr gethostbyname  3  . )
Hostnames are resolved by the Internet name resolver in the following
fashion.
.Pp
If the name consists of a single component, i.e. contains no dot,
and if the environment variable
.Dq Ev HOSTALIASES
is set to the name of a file,
that file is searched for an string matching the input hostname.
The file should consist of lines made up of two white-space separated strings,
the first of which is the hostname alias,
and the second of which is the complete hostname
to be substituted for that alias.
If a case-insensitive match is found between the hostname to be resolved
and the first field of a line in the file, the substituted name is looked
up with no further processing.
.Pp
If the input name ends with a trailing dot,
the trailing dot is removed,
and the remaining name is looked up with no further processing.
.Pp
If the input name does not end with a trailing dot, it is looked up
by searching through a list of domains until a match is found.
The default search list includes first the local domain,
then its parent domains with at least 2 name components (longest first).
For example,
in the domain CS.Berkeley.EDU, the name lithium.CChem will be checked first
as lithium.CChem.CS.Berkeley.EDU and then as lithium.CChem.Berkeley.EDU.
Lithium.CChem.EDU will not be tried, as the there is only one component
remaining from the local domain.
The search path can be changed from the default
by a system-wide configuration file (see
.Xr resolver  5  ) .
.Sh SEE ALSO
.Xr gethostbyname 3 ,
.Xr resolver 5 ,
.Xr mailaddr 7 ,
.Xr named 8
.Sh HISTORY
.Nm Hostname
appeared in 4.2 BSD.
