.ref-BSD-4_3_Reno/usr/src/share/man/man7/intro.7
.\" Copyright (c) 1983, 1990 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms are permitted provided
.\" that: (1) source distributions retain this entire copyright notice and
.\" comment, and (2) distributions including binaries display the following
.\" acknowledgement:  ``This product includes software developed by the
.\" University of California, Berkeley and its contributors'' in the
.\" documentation or other materials provided with the distribution and in
.\" all advertising materials mentioning features or use of this software.
.\" Neither the name of the University nor the names of its contributors may
.\" be used to endorse or promote products derived from this software without
.\" specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR IMPLIED
.\" WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\"
.\"     @(#)intro.7	6.2 (Berkeley) 6/24/90
.\"
.Dd June 24, 1990
.Dt INTRO 7
.Os BSD 4.2
.Sh NAME
.Nm intro
.Nd miscellaneous information pages
.Sh DESCRIPTION
This section contains miscellaneous documentation, mostly
in the area of text processing macro packages for
.Xr troff  1  .
.Pp
.Ds I
.Cw mailaddr
.Cl ascii	map of ASCII character set
.Cl environ	user environment
.Cl eqnchar	special character definitions for eqn
.Cl hier	file system hierarchy
.Cl mailaddr	mail addressing description
.Cl man	macros to typeset manual pages
.Cl \&me	macros for formatting papers
.Cl \&ms	macros for formatting manuscripts
.Cl term	conventional names for terminals
.Cw
.De
.Sh HISTORY
.Nm intro
appeared in 4.2 BSD.
