.ref-BSD-4_3_Reno/usr/src/share/man/man7/operator.7
.\" Copyright (c) 1989, 1990 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms are permitted provided
.\" that: (1) source distributions retain this entire copyright notice and
.\" comment, and (2) distributions including binaries display the following
.\" acknowledgement:  ``This product includes software developed by the
.\" University of California, Berkeley and its contributors'' in the
.\" documentation or other materials provided with the distribution and in
.\" all advertising materials mentioning features or use of this software.
.\" Neither the name of the University nor the names of its contributors may
.\" be used to endorse or promote products derived from this software without
.\" specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR IMPLIED
.\" WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\"
.\"     @(#)operator.7	5.2 (Berkeley) 6/24/90
.\"
.Dd June 24, 1990
.Dt OPERATOR 7
.Os BSD 4.4
.Sh NAME
.Nm operator
.Nd C operator precedence and order of evaluation
.Sh DESCRIPTION
.Ds I
.Cw xxxxxxxxxxxxxxxxxxxxxxxxxxxxx
.Cl Operator	Associativity
.Cl --------	-------------
.Cl \&() [] -> .	left to right
.Cl \&! ~ ++ -- - (type) * & sizeof	right to left
.Cl \&* / %	left to right
.Cl \&+ -	left to right
.Cl \&<< >>	left to right
.Cl \&< <= > >=	left to right
.Cl \&== !=	left to right
.Cl \&&	left to right
.Cl \&^	left to right
.Cl \&left to right
.Cl \&&&	left to right
.Cl \&left to right
.Cl \&?:	right to left
.Cl \&= += -= etc.	right to left
.Cl \&,	left to right
.Cw
.De
.Sh FILES
.Dw /usr/share/misc/operator
.Di L
.Dp Pa /usr/share/misc/operator
.Dp
.Sh HISTORY
4.4 BSD.
