.ref-f1c32ba81b27b47ffb2a349acff0197e6c857ad5/usr/src/usr.sbin/repquota/repquota.8
.\" Copyright (c) 1983, 1990, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Robert Elz at The University of Melbourne.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)repquota.8	6.6 (Berkeley) %G%
.\"
.Dd 
.Dt REPQUOTA 8
.Os BSD 4.2
.Sh NAME
.Nm repquota
.Nd summarize quotas for a file system
.Sh SYNOPSIS
.Nm repquota
.Op Fl g
.Op Fl u
.Op Fl v
.Ar filesystem Ar ...
.Nm repquota
.Op Fl g
.Op Fl u
.Op Fl v
.Fl a
.Sh DESCRIPTION
.Nm Repquota
prints a summary of the disk usage and quotas for the
specified file systems.
.Pp
Available options:
.Bl -tag -width Ds
.It Fl a
Print the quotas of all the filesystems listed in
.Pa /etc/fstab .
.It Fl g
Print only group quotas (the default is to print both
group and user quotas if they exist).
.It Fl u
Print only user quotas (the default is to print both
group and user quotas if they exist).
.It Fl v
Print a header line before printing each filesystem quotas.
.El
.Pp
For each user or group, the current
number files and amount of space (in kilobytes) is
printed, along with any quotas created with
.Xr edquota 8 .
.Pp
Only members of the operator group or the super-user may
use this command.
.Sh FILES
.Bl -tag -width quota.group -compact
.It Pa quota.user
at the filesystem root with user quotas
.It Pa quota.group
at the filesystem root with group quotas
.It Pa /etc/fstab
for file system names and locations
.El
.Sh SEE ALSO
.Xr quota 1 ,
.Xr quotactl 2 ,
.Xr fstab 5 ,
.Xr edquota 8 ,
.Xr quotacheck 8 ,
.Xr quotaon 8
.Sh DIAGNOSTICS
Various messages about inaccessible files; self-explanatory.
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
