.ref-BSD-4_4_Lite1/usr/src/share/man/man4/man4.vax/crl.4
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)crl.4	8.1 (Berkeley) 6/5/93
.\"
.Dd June 5, 1993
.Dt CRL 4 vax
.Os BSD 4.3
.Sh NAME
.Nm crl
.Nd
.Tn VAX
8600 console
.Tn RL Ns 02
interface
.Sh DESCRIPTION
This is a simple interface to the
.Tn DEC
.Tn RL Ns 02
disk unit which is part of the console
subsystem on the
.Tn VAX
8600 and 8650.
Access is given to the entire
.Tn RL Ns 02
disk; the pack format is the same
as that of
.Tn RL Ns 02
disks on other controllers.
As on other
.Tn VAX
console media, transfers are done a word at a time
using privileged registers (i.e., slowly).
.Pp
All
.Tn I/O
is raw; the seek addresses in raw transfers should be a multiple
of 512 bytes and a multiple of 512 bytes should be transferred,
as in other
.Dq raw
disk interfaces.
(Although the sector size is actually 256 bytes, the driver allows
operations only on 512-byte boundaries.)
.Sh FILES
.Bl -tag -width /dev/crl -compact
.It Pa /dev/crl
.El
.Sh SEE ALSO
.Xr arff 8
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.3 .
