.ref-BSD-4_4_Lite1/usr/src/share/man/man4/man4.vax/ts.4
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)ts.4	8.1 (Berkeley) 6/5/93
.\"
.Dd June 5, 1993
.Dt TS 4 vax
.Os BSD 4
.Sh NAME
.Nm ts
.Nd
.Tn TS-11
magtape interface
.Sh SYNOPSIS
.Cd "controller zs0 at uba? csr 0172520 vector tsintr"
.Cd "tape ts0 at zs0 drive 0"
.Sh DESCRIPTION
The
.Tn TS-11
combination provides a standard tape drive
interface as described in
.Xr mtio 4 .
The
.Tn TS-11
operates only at 1600
.Tn BPI ,
and only one transport
is possible per controller.
.Sh DIAGNOSTICS
.Bl -diag
.It ts%d: no write ring.
An attempt was made to write on the tape drive
when no write ring was present; this message is written on the terminal of
the user who tried to access the tape.
.Pp
.It ts%d: not online.
An attempt was made to access the tape while it
was offline; this message is written on the terminal of the user
who tried to access the tape.
.Pp
.It ts%d: hard error bn%d xs0=%b.
A hard error occurred on the tape
at block
.Em bn ;
status register 0 is printed in octal and symbolically
decoded as bits.
.El
.Sh SEE ALSO
.Xr mt 1 ,
.Xr tar 1 ,
.Xr tp 1 ,
.Xr mtio 4 ,
.Xr ht 4 ,
.Xr tm 4 ,
.Xr mt 4 ,
.Xr ut 4
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.1 .
.Sh BUGS
May hang ungracefully if a physical error (non-data) occurs.
.Pp
The device lives at the same address as a
.Tn TM-11
.Pq Xr tm 4 ;
as it is very difficult to get this device to interrupt, a generic
system assumes that a
.Nm ts
is present whenever no
.Tn TM-11
exists but
the
.Tn CSR
responds and a
.Tn TS-11
is configured.
This does no harm as long as a non-existent
.Tn TS-11
is not accessed.
