usr/src/usr.bin/w/uptime.1
.\" Copyright (c) 1980, 1990 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" %sccs.include.redist.roff%
.\"
.\"     @(#)uptime.1	6.2 (Berkeley) %G%
.\"
.Dd 
.Dt UPTIME 1
.Os BSD 3
.Sh NAME
.Nm uptime
.Nd show how long system has been up
.Sh SYNOPSIS
.Nm uptime
.Sh DESCRIPTION
Uptime prints the current time, the length of time the system has been up,
and the average number of jobs in the run queue over the last 1, 5 and
15 minutes.
It is, essentially, the first line of a
.Xr w 1
command.
.Sh FILES
.Bl -tag -width /vmunix
.It Pa /vmunix
system name list
.El
.Sh SEE ALSO
.Xr w 1
.Sh HISTORY
The
.Nm
command appeared in
.Bx 3.0 .
