.ref-ada4388eec962c43bf59fd5af50828587d1a448b/usr/src/share/man/man4/man4.vax/dhu.4
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)dhu.4	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt DHU 4 vax
.Os BSD 4.3
.Sh NAME
.Nm dhu
.Nd
.Tn DHU-11
communications multiplexer
.Sh SYNOPSIS
.Cd "device dhu0 at uba0 csr 0160440 vector dhurint dhuxint"
.Sh DESCRIPTION
A
.Tn DHU-11
provides 16 communication lines.
.Pp
An optional argument
.Ar flags
may be supplied with the device specification
in the config file indicating
that the line corresponding to
bit number
.Ar i
is not properly
connected, and should be treated as hard-wired with carrier
always present.  Thus specifying
.Ql flags 0x0004
for
.Li dhu0
would cause line
.Pa ttyS2
to be treated in this way.
.Pp
Normal I/O
control parameters for individual lines are managed by
.Xr ioctl 2
calls.
Individual
.Tn DHU-11
lines may be configured to run at any of 13 speeds
(50, 200 and 38400 baud are not available);
the speed may be set via
.Xr getty 8
or
.Xr stty 1
or may be communicated by other programs which
utilize
.Xr ioctl
such as
.Xr ifcongif 8 ,
see
.Xr tty 4 .
.Pp
The
.Tn DHU-11
driver normally uses input silos
and delays receiver interrupts by 20 milliseconds
rather than taking an interrupt on each input character.
.Sh FILES
.Bl -tag -width /dev/tty[S-Z][0-9a-f]xx -compact
.It Pa /dev/tty[S-Z][0-9a-f]
.El
.Sh DIAGNOSTICS
.Bl -diag
.It dhu(%d,%d): NXM fault.
No response from
.Tn UNIBUS
on a
.Tn DMA
transfer
within a timeout period.  This is often followed by a
.Tn UNIBUS
adapter
error.  This occurs most frequently when the
.Tn UNIBUS
is heavily loaded
and when devices which hog the bus (such as
.Tn RK07 Ns s )
are present.
It is not serious.
.Pp
.It dhu%d: silo overflow.
The character input silo overflowed
before it could be serviced.  This can happen if a hard error occurs
when the
.Tn CPU
is running with elevated priority, as the system may
then print a message on the console with interrupts disabled.
.El
.Sh NOTES
The driver currently does not make full use of the hardware
capabilities of the
.Tn DHU-11 ,
for dealing with
.Tn XON/XOFF
flow-control or hard-wired
lines for example.
.Pp
Although the devices are not the same, a
.Tn DHU-11
can convince the
.Tn DH-11
autoconfiguration code that it is a
.Tn DH-11 .
.Pp
The 4 40-way cables are a pain.
.Sh SEE ALSO
.Xr tty 4
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.3 .
