.ref-845a45a641b570c4164b05f649aca9a6fdddbe6e/usr/src/share/man/man8/adduser.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)adduser.8	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt ADDUSER 8
.Os BSD 4
.Sh NAME
.Nm adduser
.Nd procedure for adding new users
.Sh DESCRIPTION
A new user must choose a login name, which must not already appear in
.Pa /etc/passwd
or
.Pa /etc/aliases .
It must also not begin with the hyphen
.Ql Fl
character.
It is strongly recommended that it be all lower-case, and not contain
the dot
.Ql \&.
character, as that tends to confuse mailers.
An account can be added by editing a line into the passwd file; this
must be done with the password file locked e.g. by using
.Xr chpass 1
or
.Xr vipw 8 .
.Pp
A new user is given a group and user id.
Login and user id's should be unique across the system, and often across
a group of systems, since they are used to control file access.
Typically, users working on similar projects will be put in the same groups.
At the University of California, Berkeley, we have groups for system staff,
faculty, graduate students, and special groups for large projects.
.Pp
A skeletal account for a new user
\*(lqernie\*(rq
might look like:
.Bd -literal
ernie::25:30::0:0:Ernie Kovacs,508 Evans Hall,x7925,
	642-8202:/a/users/ernie:/bin/csh
.Ed
.Pp
For a description of each of these fields, see
.Xr passwd 5 .
.Pp
It is useful to give new users some help in getting started, supplying
them with a few skeletal files such as
.Pa \&.profile
if they use
.Pa /bin/sh ,
or
.Pa \&.cshrc
and
.Pa \&.login
if they use
.Pa /bin/csh .
The directory
.Pa /usr/share/skel
contains skeletal definitions of such files.
New users should be given copies of these files which, for instance,
use
.Xr tset 1
automatically at each login.
.Sh FILES
.Bl -tag -width /etc/master.passwdxx -compact
.It Pa /etc/master.passwd
user database
.It Pa /usr/share/skel
skeletal login directory
.El
.Sh SEE ALSO
.Xr chpass 1 ,
.Xr finger 1 ,
.Xr passwd 1 ,
.Xr aliases 5 ,
.Xr passwd 5 ,
.Xr pwd_mkdb 8 ,
.Xr vipw 8
.Sh BUGS
User information should (and eventually will) be stored elsewhere.
.Sh HISTORY
The
.Nm
command appeared in
.Bx 3.0 .
