.ref-845a45a641b570c4164b05f649aca9a6fdddbe6e/usr/src/share/man/man8/makedev.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)makedev.8	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt MAKEDEV 8
.Os BSD 4.2
.Sh NAME
.Nm makedev
.Nd make system special files
.Sh SYNOPSIS
.Nm MAKEDEV
.Ar device ...
.Sh DESCRIPTION
.Nm MAKEDEV
is a shell script normally used to install
special files.  It resides in the 
.Pa /dev
directory, as this is the normal location of special files.
Arguments to 
.Nm MAKEDEV
are usually of the form
.Ar device-name Ns Sy \&?
where
.Ar device-name
is one of the supported devices listed in section 4 of the
manual and
.Dq Sy \&?
is a logical unit number (0-9).  A few
special arguments create assorted collections of devices and are
listed below.
.Bl -tag -width Ds
.It Sy std
Create the
.Em standard
devices for the system; for example the standard
.Tn UNIX
devices
.Pa /dev/console and /dev/tty;
the standard hardware dependent devices,
for example in the VAX family
the
.Tn VAX-11/780
console floppy device,
.Pa /dev/floppy ,
and
.Tn VAX-11/750
and
.Tn VAX-11/730
console cassette device(s),
.Pa /dev/tu?
devices would be made for the appropriate system.
.It Sy local
Create those devices specific to the local site.  This
request causes the shell file 
.Pa /dev/MAKEDEV.local
to be executed.  Site specific commands, such as those
used to setup dialup lines as
.Pa ttyd?
should be included
in this file.
.El
.Pp
Since all devices are created using 
.Xr mknod 8 ,
this shell script is useful only to the super-user.
.Sh DIAGNOSTICS
Either self-explanatory, or generated by one of the programs
called from the script.  Use
.Ql sh -x MAKEDEV
in case of
trouble.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
