usr/src/libexec/fingerd/fingerd.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)fingerd.8	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt FINGERD 8
.Os BSD 4.3
.Sh NAME
.Nm fingerd
.Nd remote user information server
.Sh SYNOPSIS
.Nm fingerd
.Op Fl s
.Op Fl l
.Op Fl p Ar filename
.Sh DESCRIPTION
.Nm Fingerd
is a simple protocol based on
.%T RFC1196
that provides an interface to the
Name and Finger programs at several network sites.
The program is supposed to return a friendly,
human-oriented status report on either the system at the moment
or a particular person in depth.
There is no required format and the
protocol consists mostly of specifying a single
.Dq command line .
.Pp
.Nm Fingerd
listens for
.Tn TCP
requests at port 79.
Once connected it reads a single command line
terminated by a
.Aq Tn CRLF
which is passed to
.Xr finger 1 .
.Nm Fingerd
closes its connections as soon as the output is finished.
.Pp
If the line is null (i.e. just a
.Aq Tn CRLF
is sent) then 
.Xr finger
returns a
.Dq default
report that lists all people logged into
the system at that moment.
.Pp
If a user name is specified (e.g.
.Pf eric Aq Tn CRLF )
then the
response lists more extended information for only that particular user,
whether logged in or not.
Allowable
.Dq names
in the command line include both
.Dq login names
and
.Dq user names .
If a name is ambiguous, all possible derivations are returned.
.Pp
The following options may be passed to
.Nm fingerd
as server program arguments in
.Pa /etc/inetd.conf :
.Bl -tag -width Ds
.It Fl s
Enable secure mode.
Queries without a user name are rejected and
forwarding of queries to other remote hosts is denied.
.It Fl l
Enable logging.
The name of the host originating the query is reported via
.Xr syslog 3
at LOG_NOTICE priority.
.It Fl p
Use an alternate program as the local information provider.
The default local program
executed by
.Nm fingerd
is 
.Xr finger 1 .
By specifying a customized local server,
this option allows a system manager
to have more control over what information is
provided to remote sites.
.El
.Sh SEE ALSO
.Xr finger 1
.Sh BUGS
Connecting directly to the server from a
.Tn TIP
or an equally narrow-minded
.Tn TELNET Ns \-protocol
user program can result
in meaningless attempts at option negotiation being sent to the
server, which will foul up the command line interpretation.
.Nm Fingerd
should be taught to filter out
.Tn IAC Ns \'s
and perhaps even respond
negatively
.Pq Tn IAC WON'T
to all option commands received.
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.3 .
