usr/src/sbin/mount_lfs/mount_lfs.8
.\" Copyright (c) 1993, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.roff%
.\"
.\"	@(#)mount_lfs.8	8.3 (Berkeley) %G%
.\"
.Dd ""
.Dt MOUNT_LFS 8
.Os BSD 4.4
.Sh NAME
.Nm mount_lfs
.Nd mount a log-structured file system
.Sh SYNOPSIS
.Nm mount_lfs
.Op Fl dns
.Op Fl o Ar options
.Ar special
.Ar node
.Sh DESCRIPTION
The
.Nm mount_lfs
command attaches a log-structured file system
.Ar special
device on to the file system tree at the point
.Ar node .
In addition, the
.Xr lfs_cleanerd 8
utility is invoked to clean the file system periodically.
.Pp
This command is normally executed by
.Xr mount 8
at boot time.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl d
Run
.Xr lfs_cleanerd 8
in debug mode.
.It Fl o
Options are specified with a
.Fl o
flag followed by a comma separated string of options.
See the
.Xr mount 8
man page for possible options and their meanings.
.It Fl n
Don't start
.Xr lfs_cleanerd 8
on the file system.
.It Fl s
Cause
.Xr lfs_cleanerd 8
to read data in small chunks when cleaning the file system.
.El
.Sh SEE ALSO
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr fstab 5 ,
.Xr lfs_cleanerd 8 ,
.Xr mount 8
.Sh HISTORY
The
.Nm mount_lfs
function first appeared in 4.4BSD.
