.ref-1d33b1148ce80b9b3332d3e497469df7d82a8ee1/usr/src/share/man/man4/man4.vax/il.4
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)il.4	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt IL 4 vax
.Os BSD 4.2
.Sh NAME
.Nm il
.Nd Interlan NI1010 10 Mb/s Ethernet interface
.Sh SYNOPSIS
.Cd "device il0 at uba0 csr 164000 vector ilrint ilcint"
.Sh DESCRIPTION
The
.Nm il
interface provides access to a 10 Mb/s Ethernet network through
an Interlan 1010 or 1010A controller.
.Pp
Each of the host's network addresses
is specified at boot time with an
.Dv SIOCSIFADDR
.Xr ioctl 2 .
The
.Nm il
interface employs the address resolution protocol described in
.Xr arp 4
to dynamically map between Internet and Ethernet addresses on the local
network.
.Pp
The interface normally tries to use a ``trailer'' encapsulation
to minimize copying data on input and output.
The use of trailers is negotiated with
.Tn ARP .
This negotiation may be disabled, on a per-interface basis,
by setting the
.Dv IFF_NOTRAILERS
flag with an
.Dv SIOCSIFFLAGS
.Xr ioctl .
.Sh DIAGNOSTICS
.Bl -diag
.It il%d: input error.
The hardware indicated an error
in reading a packet off the cable or an illegally sized packet.
.Pp
.It il%d: can't handle af%d.
The interface was handed
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
.Pp
.It il%d: setaddr didn't work.
The interface was unable to reprogram
its physical ethernet address.
This may happen with very early models of the interface.
This facility is used only when
the controller is not the first network interface configured for
.Tn XNS .
The oldest interface tested (2.7.1.0.1.45) has never failed in this way.
.Pp
.It il%d: reset failed, csr=%b.
.It il%d: status failed, csr=%b.
.It il%d: hardware diag failed, csr=%b.
.It il%d: verifying setaddr, csr=%b.
.It il%d: stray xmit interrupt, csr=%b.
.It il%d: can't initialize.
The above messages indicate a probable hardware error performing
the indicated operation during autoconfiguration or initialization.
The status field in the control and status register (the low-order four bits)
should indicate the nature of the failure.
See the hardware manual for details.
.El
.Sh SEE ALSO
.Xr netintro 4 ,
.Xr inet 4 ,
.Xr arp 4
.Sh HISTORY
The
.Nm
interface appeared in
.Bx 4.2 .
