.ref-1d33b1148ce80b9b3332d3e497469df7d82a8ee1/usr/src/share/man/man4/lo.4
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)lo.4	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt LO 4
.Os BSD 4.2
.Sh NAME
.Nm lo
.Nd software loopback network interface
.Sh SYNOPSIS
.Sy pseudo-device
.Nm loop
.Sh DESCRIPTION
The
.Nm loop
interface is a software loopback mechanism which may be
used for performance analysis, software testing, and/or local
communication.
As with other network interfaces, the loopback interface must have
network addresses assigned for each address family with which it is to be used.
These addresses
may be set or changed with the
.Dv SIOCSIFADDR
.Xr ioctl 2 .
The loopback interface should be the last interface configured,
as protocols may use the order of configuration as an indication of priority.
The loopback should
.Em never
be configured first unless no hardware
interfaces exist.
.Sh DIAGNOSTICS
.Bl -diag
.It lo%d: can't handle af%d.
The interface was handed
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr inet 4 ,
.Xr ns 4
.Sh HISTORY
The
.Nm
device appeared in
.Bx 4.2 .
.Sh BUGS
Previous versions of the system enabled the loopback interface
automatically, using a nonstandard Internet address (127.1).
Use of that address is now discouraged; a reserved host address
for the local network should be used instead.
