.ref-1d33b1148ce80b9b3332d3e497469df7d82a8ee1/usr/src/share/man/man4/nsip.4
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)nsip.4	8.2 (Berkeley) %G%
.\"
.Dd 
.Dt NSIP 4
.Os BSD 4.3
.Sh NAME
.Nm nsip
.Nd software network interface encapsulating NS packets in IP packets
.Sh SYNOPSIS
.Cd options NSIP
.Fd #include <netns/ns_if.h>
.Sh DESCRIPTION
The
.Nm nsip
interface is a software mechanism which may be
used to transmit Xerox
.Tn NS Ns (tm)
packets through otherwise uncooperative
networks.
It functions by prepending an
.Tn IP
header, and resubmitting the packet
through the
.Tn UNIX
.Tn IP
machinery.
.Pp
The super-user can advise the operating system of a willing partner
by naming an
.Tn IP
address to be associated with an
.Tn NS
address.
Presently, only specific hosts pairs are allowed, and for each host
pair, an artificial point-to-point interface is constructed.
At some future date,
.Tn IP
broadcast addresses or hosts may be paired
with
.Tn NS
networks or hosts.
.Pp
Specifically, a socket option of
.Dv SO_NSIP_ROUTE
is set on a socket
of family
.Dv AF_NS ,
type
.Dv SOCK_DGRAM ,
passing the following structure:
.Bd -literal
struct nsip_req {
	struct sockaddr rq_ns;	/* must be ns format destination */
	struct sockaddr rq_ip;	/* must be ip format gateway */
	short rq_flags;
};
.Ed
.Sh DIAGNOSTICS
.Bl -diag
.It nsip%d: can't handle af%d.
The interface was handed
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr ns 4
.Sh HISTORY
The
.Nm
interface appeared in
.Bx 4.3 .
.Sh BUGS
It is absurd to have a separate pseudo-device for each pt-to-pt
link.
There is no way to change the
.Tn IP
address for an
.Tn NS
host once the
encapsulation interface is set up.
The request should honor flags of
.Dv RTF_GATEWAY
to indicate
remote networks, and the absence of
.Dv RTF_UP
should be a clue
to remove that partner.
This was intended to postpone the necessity of rewriting reverse
.Tn ARP
for the 
.Xr en 4
device, and to allow passing
.Tn XNS
packets through an
Arpanet-Milnet gateway, to facilitate testing between some co-operating
universities.
