dspinellis/unix-history-repo/.ref-386BSD-0.1-patchkit/usr/othersrc/share/man/man8/man8.tahoe/MAKEDEV.8
.\" Copyright (c) 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)MAKEDEV.8	5.2 (Berkeley) 3/22/91
.\"
.TH MAKEDEV 8 "March 22, 1991"
.UC 7
.SH NAME
MAKEDEV \- create system and device special files
.SH SYNOPSIS
MAKEDEV name ...
.SH DESCRIPTION
The shell script
.IR MAKEDEV ,
found in the ``/dev'' directory, is used to create the common special
files.
See
.IR special (8)
for a more complete discussion of special files.
.PP
.I MAKEDEV
takes any number of device names as arguments, where the names are
the common abbreviation for the device.
There are two special devices, ``std'' and ``local''.
The former creates the standard devices for the architecture.
The latter is for devices specific to the local site, and
executes the shell file ``MAKEDEV.local''.
.PP
The Tahoe supports the following devices.
Where a device name is followed by a hash sign (``#''), the hash sign
must be replaced by a unit number.
.TP 10
std
the standard devices (CP, console, drum, fd/*, klog, kmem, mem, null,
remote, stderr, stdin, stdout, tty, vmem)
.br
.ns
.TP 10
local
configuration specific devices
.br
.ns
.TP 10
cy#
Cipher
.br
.ns
.TP 10
dk#
VDDC or SMDE disk on Versabus
.br
.ns
.TP 10
dr#
IKON DR-11W
.br
.ns
.TP 10
enp#
CMC Ethernet interface for loading RAM
.br
.ns
.TP 10
hd#
VDDC or SMDE disk on VME
.br
.ns
.TP 10
ik#
IKON DR-11W w/ E&S PS300
.br
.ns
.TP 10
mp#
MPCC
.br
.ns
.TP 10
pty#
set of 32 master and slave pseudo terminals
.br
.ns
.TP 10
vx#
VIOC
.SH FILES
/dev		The special file directory.
.SH SEE ALSO
.IR mknod (1), 
.IR intro (4),
.IR config (8),
.IR special (8)
