.ref-1d33b1148ce80b9b3332d3e497469df7d82a8ee1/usr/src/usr.sbin/quotaon/quotaon.8
.\" Copyright (c) 1983, 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Robert Elz at The University of Melbourne.
.\" %sccs.include.redist.man%
.\"
.\"     @(#)quotaon.8	8.2 (Berkeley) %G%
.\"
.Dd 
.Dt QUOTAON 8
.Os BSD 4.2
.Sh NAME
.Nm quotaon ,
.Nm quotaoff
.Nd turn filesystem quotas on and off
.Sh SYNOPSIS
.Nm quotaon
.Op Fl g
.Op Fl u
.Op Fl v
.Ar filesystem Ar ...
.Nm quotaon
.Op Fl g
.Op Fl u
.Op Fl v
.Fl a
.Nm quotaoff
.Op Fl g
.Op Fl u
.Op Fl v
.Ar filesystem Ar ...
.Nm quotaoff
.Op Fl g
.Op Fl u
.Op Fl v
.Fl a
.Sh DESCRIPTION
.Nm Quotaon
announces to the system that disk quotas should be enabled on one or more
filesystems.
.Nm Quotaoff
announces to the system that the specified
filesystems should have any disk quotas
diskquotas turned off.
The filesystems specified must have entries in
.Pa /etc/fstab
and be mounted.
.Nm Quotaon
expects each filesystem to have quota files named
.Pa quota.user
and
.Pa quota.group
which are located at the root of the associated file system.
These defaults may be overridden in
.Pa /etc/fstab .
By default both user and group quotas are enabled.
.Pp
Available options:
.Bl -tag -width Ds
.It Fl a
If the
.Fl a
flag is supplied in place of any filesystem names,
.Nm quotaon Ns / Ns Nm quotaoff
will enable/disable all the filesystems indicated in
.Pa /etc/fstab
to be read-write with disk quotas.
By default only the types of quotas listed in
.Pa /etc/fstab
are enabled.
.It Fl g
Only group quotas listed in
.Pa /etc/fstab
should be enabled/disabled.
.It Fl u
Only user quotas listed in
.Pa /etc/fstab
should be enabled/disabled.
.It Fl v
Causes
.Nm quotaon
and
.Nm quotaoff
to print a message for each filesystem where quotas are turned on or off.
.El
.Pp
Specifying both
.Fl g
and
.Fl u
is equivalent to the default.
.Sh FILES
.Bl -tag -width quota.group -compact
.It Pa quota.user
at the filesystem root with user quotas
.It Pa quota.group
at the filesystem root with group quotas
.It Pa /etc/fstab
filesystem table
.El
.Sh SEE ALSO
.Xr quota 1 ,
.Xr quotactl 2 ,
.Xr fstab 5 ,
.Xr edquota 8 ,
.Xr quotacheck 8 ,
.Xr repquota 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
