usr/src/sbin/swapon/swapon.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)swapon.8	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt SWAPON 8
.Os BSD 4
.Sh NAME
.Nm swapon
.Nd "specify additional device for paging and swapping"
.Sh SYNOPSIS
.Nm swapon
.Fl a
.Nm swapon
.Ar special_file ...
.Sh DESCRIPTION
.Nm Swapon
is used to specify additional devices on which paging and swapping
are to take place.
The system begins by swapping and paging on only a single device
so that only one disk is required at bootstrap time.
Calls to
.Nm swapon
normally occur in the system multi-user initialization file
.Pa /etc/rc
making all swap devices available, so that the paging and swapping
activity is interleaved across several devices.
.Pp
Normally, the first form is used:
.Bl -tag -width Ds
.It Fl a
All devices marked as ``sw''
swap devices in
.Pa /etc/fstab
are made available.
.El
.Pp
The second form gives individual block devices as given
in the system swap configuration table.  The call makes only this space
available to the system for swap allocation.
.Sh SEE ALSO
.Xr swapon 2 ,
.Xr fstab 8
.Xr init 8
.Xr rc 8
.Sh FILES
.Bl -tag -width /dev/[ru][pk]?b -compact
.It Pa /dev/[ru][pk]?b
standard paging devices
.It Pa /etc/fstab
ascii filesystem description table
.El
.Sh BUGS
There is no way to stop paging and swapping on a device.
It is therefore not possible to make use of devices which may be
dismounted during system operation.
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.0 .
