.ref-1d33b1148ce80b9b3332d3e497469df7d82a8ee1/usr/src/usr.sbin/config.new/config.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)config.8	8.2 (Berkeley) %G%
.\"
.Dd 
.Dt CONFIG.NEW 8
.Os BSD 4
.Sh NAME
.Nm config.new
.Nd build kernel compilation directories
.Sh SYNOPSIS
.Nm config
.Op Fl p
.Ar system-name
.Sh DESCRIPTION
.Pp
This is the new version of the
.Nm config
program.
It understands the more modern autoconfiguration scheme
used on the SPARC and i386 platforms.
The old version of config is still used with the
HP300, DECstation, and derivative platforms.
Only the version of 
.Nm config
applicable to the architecture that you are running
will be installed on your machine.
.Pp
.Nm Config
builds a set of configuration files from the file
.Ar system-name ,
which describes
the system to configure.
.Pp
.Nm Config
should run from the
.Pa conf
subdirectory of the top-level machine-specific directory
of the system source (usually
.Pa /sys/MACHINE/conf ,
where
.Pa MACHINE
is one of
.Pa vax ,
.Pa tahoe ,
.Pa hp300 ,
and so forth).
.Nm Config
assumes the directory
.Pa ../../compile
exists; it places all output files in a subdirectory there,
creating the subdirectory if necessary.
The subdirectory name is taken from the
.Ar system-name ;
thus, configuring with
.Dq Li config PICKLE
will use the directory
.Pa ../../compile/PICKLE .
.Pp
If the
.Fl p
option is supplied,
.Pa .PROF
is appended to the compilation directory name, and
.Nm config
acts as if the lines
.Dq Li makeoptions PROF="-pg"
and
.Dq Li options GPROF
appeared in the configuration file.
This will build a system that includes profiling code; see
.Xr kgmon 8
and
.Xr gprof 1 .
The
.Fl p
flag is expected to be used for
.Dq one-shot
profiles of existing systems;
for regular profiling,
it is probably wiser to make a separate configuration
containing the
.Li makeoptions
line.
.Pp
The old undocumented
.Fl g
flag is no longer supported.
Instead, use
.Dq Li makeoptions DEBUG="-g"
and (typically)
.Dq Li options KGDB .
.Pp
The output of
.Nm config
consists of a number of files, principally
.Pa ioconf.c ,
a description of I/O devices that may be attached to the system; and a
.Pa Makefile ,
used by
.Xr make 1
in building the kernel.
.Pp
After running
.Nm config ,
it is wise to run
.Dq Li make depend
in the directory where the new makefile
was created.
.Nm Config
prints a reminder of this when it completes.
.Pp
If
.Nm config
stops due to errors, the problems reported should be corrected and
.Nm config
should be run again.
.Nm Config
attempts to avoid changing the compilation directory
if there are configuration errors,
but this code is not well-tested,
and some problems (such as running out of disk space)
are unrecoverable.
.Sh SEE ALSO
The SYNOPSIS portion of each device in section 4.
.Rs
.%T "Building 4.4 BSD Systems with Config"
.\" .%T "Device Support in 4.4BSD"
.Re
.sp
.Xr config 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.1 .
It was completely revised in
.Bx 4.4 .
