.ref-26af45907971fe96fc69c497470a08ea8542e499/usr/src/usr.bin/at/atrm/atrm.1
.\" Copyright (c) 1985, 1990 The Regents of the University of California.
.\" All rights reserved.
.\"
.\"     @(#)atrm.1	6.4 (Berkeley) 7/24/90
.\" %sccs.include.redist.man%
.\"
.\"     @(#)atrm.1	6.5 (Berkeley) %G%
.\"
.Dd 
.Dt ATRM 1
.Os BSD 4.3
.Sh NAME
.Nm atrm
.Nd remove jobs spooled by
.Xr at 1
.Sh SYNOPSIS
.Nm atrm
.Op Fl f
.Op Fl i
.Op Fl
.Oo Op Ar job #
.Op Ar name ... Oc
.Sh DESCRIPTION
.Nm Atrm
removes jobs that were created with the
.Xr at 1
command.
.Pp
Options available are:
.Bl -tag -width Ds
.It Fl f
all information regarding the
removal of the specified jobs is suppressed.
.It Fl i
.Nm atrm
asks if a job should be removed; a response of
.Ql y
causes the job to be removed.
.It Fl
all jobs belonging to the person invoking
.Nm atrm
are removed.
.El
.Pp
If a
.Ar job
number(s) is specified,
.Nm atrm
attempts to remove only that
.Ar job
number(s).
.Pp
If a user(s) name is specified, all
jobs belonging to that user(s) are removed.
This form of invoking
.Nm atrm
is useful only to the super-user.
.Sh FILES
.Bl -tag -width /usr/spool/at -compact
.It Pa /usr/spool/at
spool area
.El
.Sh SEE ALSO
.Xr at 1 ,
.Xr atq 1 ,
.Xr cron 8
.Sh HISTORY
The
.Nm
command appeared in 
.Bx 4.3 .
