.ref-26af45907971fe96fc69c497470a08ea8542e499/usr/src/share/man/man7/intro.7
.\" Copyright (c) 1983, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)intro.7	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt INTRO 7
.Os BSD 4.2
.Sh NAME
.Nm intro
.Nd miscellaneous information pages
.Sh DESCRIPTION
This section contains miscellaneous documentation, mostly
in the area of text processing macro packages for
.Xr troff  1  .
.Pp
.Ds I
.Cw mailaddr
.Cl ascii	map of ASCII character set
.Cl environ	user environment
.Cl eqnchar	special character definitions for eqn
.Cl hier	file system hierarchy
.Cl mailaddr	mail addressing description
.Cl man	macros to typeset manual pages
.Cl \&me	macros for formatting papers
.Cl \&ms	macros for formatting manuscripts
.Cl term	conventional names for terminals
.Cw
.De
.Sh HISTORY
.Nm intro
appeared in 4.2 BSD.
