.ref-4d568c0305b89276acf12c9f6bfae8ea44a5b7b5/usr/src/share/man/man7/environ.7
.\" Copyright (c) 1983, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.roff%
.\"
.\"	@(#)environ.7	8.2 (Berkeley) %G%
.\"
.Dd 
.Dt ENVIRON 7
.Os BSD 4.2
.Sh NAME
.Nm environ
.Nd user environment
.Sh SYNOPSIS
.Ar extern char **environ ;
.Sh DESCRIPTION
An array of strings called the
.Ar environment
is made available by
.Xr execve  2
when a process begins.  By convention these strings have the form
.Dq Ar name=value .
The following names are used by various commands:
.Bl -tag -width BLOCKSIZE
.It Ev BLOCKSIZE
The size of the block units used by several commands, most notably
.Xr df 1 ,
.Xr du 1
and
.Xr ls 1 .
BLOCKSIZE may be specified in units of a byte by specifying a number, 
in units of a kilobyte by specifying a number followed by ``K'' or
``k'', in units of a megabyte by specifying a number followed by ``M''
or ``m'' and in units of a gigabyte by specifying a number followed
by ``G'' or ``g''.
Sizes less than 512 bytes or greater than a gigabyte are ignored.
.It Ev EXINIT
A startup list of commands read by
.Xr ex  1  ,
.Xr edit  1 ,
and
.Xr vi  1  .
.It Ev HOME
A user's login directory, set by
.Xr login  1
from the password file
.Xr passwd  5  .
.It Ev PATH
The sequence of directories, separated by colons, searched by
.Xr csh  1  ,
.Xr sh  1 ,
.Xr system  3  ,
.Xr execvp  3 ,
etc, when looking for an executable file.
PATH is set to ``:/usr/ucb:/bin:/usr/bin'' initially by
.Xr login  1  .
.It Ev PRINTER
The name of the default printer to be used by
.Xr lpr  1  ,
.Xr lpq  1 ,
and
.Xr lprm  1  .
.It Ev SHELL
The full pathname of the user's login shell.
.It Ev TERM
The kind of terminal for which output is to be prepared.
This information is used by commands, such as
.Xr nroff  1
or
.Xr plot 1
which may exploit special terminal capabilities.  See
.Pa /usr/share/misc/termcap
.Pq Xr tmercap 5
for a list of terminal types.
.It Ev TERMCAP
The string describing the terminal in TERM, or, if
it begins with a '/', the name of the termcap file.
See
.Ev TERMPATH
below,
.Xr termcap  5  ,
and
.Xr termcap  .
.It Ev TERMPATH
A sequence of pathnames of termcap files, separated by colons or spaces,
which are searched for terminal descriptions in the order listed.  Having
no
.Ev TERMPATH
is equivalent to a
.Ev TERMPATH
of
.Dq Pa $HOME/.termcap:/etc/termcap .
.Ev TERMPATH
is ignored if
.Ev TERMCAP
contains a full pathname.
.It Ev TMPDIR
The directory in which to store temporary files.
Most applications use either
.Dq /tmp
or
.Dq /var/tmp .
Setting this variable will make them use another directory.
.It Ev TZ
The timezone to use when displaying dates.
The normal format is a pathname relative to
.Dq /usr/share/zoneinfo .
For example, the command
.Dq env TZ=US/Pacific date
displays the current time in California.
See
.Xr tzset 3
for more information.
.It Ev USER
The login name of the user.
.El
.Pp
Further names may be placed in the environment by the
.Xr export
command and
.Ar name=value
arguments in
.Xr sh  1  ,
or by the
.Xr setenv
command if you use
.Xr csh  1  .
It is unwise to change certain
.Xr sh  1
variables that are frequently exported by
.Pa .profile
files, such as
.Ev MAIL ,
.Ev PS1 ,
.Ev PS2 ,
and
.Ev IFS ,
unless you know what you are doing.
.Sh SEE ALSO
.Xr csh 1 ,
.Xr ex 1 ,
.Xr login 1 ,
.Xr sh 1 ,
.Xr execve 2 ,
.Xr execle 3 ,
.Xr system 3 ,
.Xr termcap 3 ,
.Xr termcap 5
.Sh HISTORY
The
.Nm environ
manual page appeared in
.Bx 4.2 .
