usr/src/usr.sbin/timed/timedc/timedc.8
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)timedc.8	6.7 (Berkeley) %G%
.\"
.Dd 
.Dt TIMEDC 8
.Os BSD 4.3
.ad
.Sh NAME
.Nm timedc
.Nd timed control program
.Sh SYNOPSIS
.Nm timedc
.Oo Ar command\ \&
.Op Ar argument ...
.Oc
.Sh DESCRIPTION
.Nm Timedc
is used to control the operation of the
.Xr timed 8
program.
It may be used to:
.Bl -bullet
.It
Measure the differences between machines' clocks,
.It 
Find the location where the master time server is running,
.It
Enable or disable tracing of messages received by
.Xr timed ,
and
.It
Perform various debugging actions.
.El
.Pp
Without any arguments,
.Nm timedc
will prompt for commands from the standard input.
If arguments are supplied,
.Nm timedc
interprets the first argument as a command and the remaining
arguments as parameters to the command.  The standard input
may be redirected causing
.Nm timedc
to read commands from a file.
Commands may be abbreviated;
recognized commands are:
.Pp
.Bl -tag -width Ds -compact
.It Ic \&? Op Ar command ...
.Pp
.It Ic help Op Ar command ...
Print a short description of each command specified in the argument list,
or, if no arguments are given, a list of the recognized commands.
.Pp
.It Ic clockdiff Ar host ...
Compute the differences between the clock of the host machine
and the clocks of the machines given as arguments.
.Pp
.It Ic msite Op Ar host ...
Show the master time server for specified host(s).
.Pp
.It Xo
.Ic trace
.Li \&{ Ar on Li \&|
.Ar off \&}
.Xc
Enable or disable the tracing of incoming messages to
.Xr timed
in the file
.Pa /var/log/timed.log.
.Pp
.It Ic election Ar host
Asks the daemon
on the target host to reset its "election" timers and to ensure that
a time master has been elected.
.Pp
.It Ic quit
Exit from timedc.
.El
.Pp
Other commands may be included for use in testing and debugging
.Xr timed ;
the help command and
the program source may be consulted for details.
.Sh FILES
.Bl -tag -width /var/log/timed.masterlog -compact
.It Pa /var/log/timed.log
tracing file for timed
.It Pa /var/log/timed.masterlog
log file for master timed
.El
.Sh SEE ALSO
.Xr date 1 ,
.Xr adjtime 2 ,
.Xr icmp 4 ,
.Xr timed 8 ,
.Rs
.%T "TSP: The Time Synchronization Protocol for UNIX 4.3BSD"
.%A R. Gusella
.%A S. Zatti
.Re
.Sh DIAGNOSTICS
.Bl -tag -width Ds -compact
.It ?Ambiguous command
abbreviation matches more than one command
.It ?Invalid command
no match found
.It ?Privileged command
command can be executed by root only
.El
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.3 .
