.ref-ada4388eec962c43bf59fd5af50828587d1a448b/usr/src/share/man/man4/man4.tahoe/enp.4
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)enp.4	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt ENP 4 tahoe
.Os BSD 4.3t
.Sh NAME
.Nm enp
.Nd
.Tn CMC
10 Mb/s Ethernet interface
.Sh SYNOPSIS
.Cd "device enp0 at vba? csr 0xfff40000 vector enpintr"
.Sh DESCRIPTION
The
.Nm enp
interface provides access to a 10 Mb/s Ethernet network through
a
.Tn CMC ENP-20
controller.
.Pp
The hardware has 128 kilobytes of dual-ported memory on the
.Tn VERSAbus . 
This memory
is used for internal buffering by the board, and the interface code reads
the buffer contents directly through the
.Tn VERSAbus .
The address of this memory is derived from the address specified
in the configuration file.
.Pp
Each of the host's network addresses
is specified at boot time with an
.Dv SIOCSIFADDR
.Xr ioctl 2 .
The
.Nm enp
interface employs the address resolution protocol described in
.Xr arp 4
to dynamically map between Internet and Ethernet addresses on the local
network.
.Pp
The interface normally tries to use a
.Dq trailer
encapsulation
to minimize copying data on input and output.
The use of trailers is negotiated with
.Tn ARP .
This negotiation may be disabled, on a per-interface basis,
by setting the
.Dv IFF_NOTRAILERS
flag with an
.Dv SIOCSIFFLAGS
.Xr ioctl .
.Pp
Associated with each interface is a character device which
is used to dowload, start, and reset the firmware in the controller.
Reading or writing the
.Dq ram device
reads or writes the writable
control store in the controller.  Two
.Xr ioctl 2
calls,
.Dv ENPIOGO
and
.Dv ENPIORESET ,
are used to start and reset the
firmware.
.Sh DIAGNOSTICS
.Bl -diag
.It enp%d: can't handle af%d.
The interface was handed
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr inet 4 ,
.Xr arp 4 ,
.Xr enpload 8
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.3 tahoe .
.Sh BUGS
The hardware is not capable of talking to itself.  The software
implements local sending and broadcast by sending such packets to the
loop interface.  This is a kludge.
.Pp
The link level firmware does not support setting the board's
Ethernet address.
