usr/src/sbin/reboot/boot_tahoe.8
.\" Copyright (c) 1980, 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)boot_tahoe.8	6.4 (Berkeley) %G%
.\"
.Dd 
.Dt REBOOT 8
.Os BSD 4
.Sh NAME
.Nm reboot
.Nd
.Tn UNIX
bootstrapping procedures
.Sh SYNOPSIS
.Nm reboot
.Op Fl n
.Op Fl q
.Sh DESCRIPTION
.Pp
.Tn UNIX
is started by placing it in memory
at location zero and transferring to the entry point.
Since the system is not reenterable,
it is necessary to read it in from disk or tape
each time it is to be bootstrapped.
.Pp
.Sy Rebooting a running system .
When a
.Tn UNIX
is running and a reboot is desired,
.Xr shutdown 8
is normally used.
If there are no users then
.Nm reboot
can be used.
Reboot causes the disks to be synced and allows the system
to perform other shutdown activities such as resynchronizing
hardware time-of-day clocks.
A multi-user reboot (as described below) is then initiated.
This causes a system to be
booted and an automatic disk check to be performed.  If all this succeeds
without incident, the system is then brought up for many users.
.Pp
Options to reboot are:
.Bl -tag -width Ds
.It Fl n
option avoids the sync.  It can be used if a disk or the processor
is on fire. 
.It Fl q
reboots quickly and ungracefully, without shutting down running
processes first.
.El
.Pp
.Nm Reboot
normally logs the reboot using
.Xr syslog 8
and places a shutdown record in the login accounting file
.Pa /var/log/wtmp.
These actions are inhibited if the
.Fl n
or
.Fl q
options are present.
.Pp
.Sy Power fail and crash recovery.
Normally, the system will reboot itself at power-up or after crashes.
An automatic consistency check of the file systems will be performed
as described in
.Xr fsck 8 .
and unless this fails, the system will resume multi-user operations.
.Pp
.Sy Cold starts .
These are processor-type dependent.
On the
.Tn CCI
Power 6/32 and related processors,
the system will do a standard autoboot from drive 0
upon power-up or reset.
This automatic boot may be cancelled by typing a
.Ql \&#
in the first few seconds after reset.
This enters console mode; the console prompt is
.Ql >
or
.Ql \&# .
The boot flags can be set to any hexadecimal value
.Fl n
with the command
.Pp
.Bd -filled -offset indent -compact
.Li \&#> p23
.Ar n .
.Ed
.Pp
The default device may be examined or set; see the Diagnostics and Debugging
manual for the processor for details on device naming and syntax.
After setting the boot flags and/or device,
a bootstrap sequence can be initiated with
.Pp
.Dl #> fb
.Pp
A specific device or bootstrap file may be used; for example,
.Pp
.Dl \&#> \&fb xfd(1,0)
.Pp
would boot from the `a' partition on
.Tn XFD
drive 1.
.Pp
The file specifications used for the boostrap
when loaded with the
.Dq askme
flag
(register 23 set to 1 or 3)
are of the form:
.Pp
.Dl device(adaptor,controller,unit,minor)
.Pp
where
.Ar device
is the type of the device to be searched,
.Ar adaptor
is number of the
.Tn VERSAbus
(or
.Tn VMEbus )
to which the device is attached,
.Ar controller
is the unit number of the controller on that buss,
.Ar unit
is the unit number of the disk or tape,
and
.Ar minor
is the disk partition or tape file number.
Leading adaptor or controller numbers default to 0.
Normal line editing characters can be used when typing the file specification.
The following list of supported devices may vary from installation to
installation:
.Pp
.Bd -unfilled -offset indent -compact
dk	SMD or ESDI disks on VDDC or SMD-E
cy	tape on Ciprico Tapemaster controller
.Ed
.Pp
For example,
to boot from a file system which starts at cylinder 0
of unit 0 of an
.Tn SMD-E
disk, type
.Ql dk(0,0)vmunix
to the boot prompt;
.Ql dk(2,1,0)vmunix
would specify drive 1 on
.Tn SMD-E
controller 2.
.Pp
In an emergency, the bootstrap methods described in the paper
.%T "Installing and Operating 4.3 BSD-tahoe UNIX on the Tahoe"
can be used
to boot from a distribution tape.
.Sh FILES
.Bl -tag -width /vmunix -compact
.It Pa /vmunix
system code
.It Pa /boot
system bootstrap
.El
.Sh SEE ALSO
.Xr crash 8 ,
.Xr disklabel 8 ,
.Xr fsck 8 ,
.Xr halt 8 ,
.Xr init 8 ,
.Xr rc 8 ,
.Xr shutdown 8 ,
.Xr syslogd 8
.Sh BUGS
The disklabel format used by some versions of the console processor
is different than the format used by
.Tn UNIX
and the bootstrap.
.Sh HISTORY
The
.Nm
command
.Ud
