usr/src/share/man/man5/networks.5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.roff%
.\"
.\"     @(#)networks.5	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt NETWORKS 5
.Os BSD 4.2
.Sh NAME
.Nm networks
.Nd network name data base
.Sh DESCRIPTION
The
.Xr networks
file contains information regarding
the known networks which comprise the
.Tn DARPA
Internet.
For each network a single line should be present with the following information:
.Bd -unfilled -offset indent
official network name
network number
aliases
.Ed
.Pp
Items are separated by any number of blanks and/or tab characters.
A ``#'' indicates the beginning of a comment; characters up to the end of
the line are not interpreted by routines which search the file.
This file is normally created from the official network data base
maintained at the Network Information Control Center
.Pq Tn NIC , 
though local
changes may be required to bring it up to date regarding unofficial aliases
and/or unknown networks.
.Pp
Network number may be specified in the conventional
``.''  (dot) notation using the
.Xr inet_network 3
routine
from the Internet address manipulation library,
.Xr inet 3 .
Network names may contain any printable character other than a field
delimiter, newline, or comment character.
.Sh FILES
.Bl -tag -width /etc/networks -compact
.It Pa /etc/networks
The
.Nm networks
file resides in
.Pa /etc .
.El
.Sh SEE ALSO
.Xr getnetent 3
.Sh BUGS
A name server should be used instead of a static file.
.Sh HISTORY
The
.Nm
file format appeared in
.Bx 4.2 .
