usr/src/share/man/man5/phones.5
.\" Copyright (c) 1983, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" %sccs.include.redist.roff%
.\"
.\"     @(#)phones.5	6.3 (Berkeley) %G%
.\"
.Dd 
.Dt PHONES 5
.Os BSD 4.2
.Sh NAME
.Nm phones
.Nd remote host phone number data base
.Sh DESCRIPTION
The file
.Pa /etc/phones
contains the system-wide
private phone numbers for the
.Xr tip 1
program.  This file is normally unreadable, and so may contain
privileged information.  The format of the file is a series of lines
of the form: <system-name>[\ \et]*<phone-number>.  The system name is
one of those defined in the
.Xr remote 5
file and the phone number is constructed from any sequence of
characters terminated only by ``,'' or the end of the line.
The ``='' and ``*'' characters are
indicators to the auto call units to pause and wait for a second dial
tone (when going through an exchange).  The ``='' is required by the
.Tn DF02-AC
and the ``*'' is required by the
.Tn BIZCOMP
1030.
.Pp
Only one phone number per line is permitted.  However, if more than
one line in the file contains the same system name
.Xr tip 1
will attempt to dial each one in turn, until it establishes a connection.
.Sh FILES
.Bl -tag -width /etc/phones -compact
.It Pa /etc/phones
.El
.Sh SEE ALSO
.Xr tip 1 ,
.Xr remote 5
.Sh HISTORY
The
.Nm
file appeared in
.Bx 4.2 .
