usr/src/share/man/man5/protocols.5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.roff%
.\"
.\"     @(#)protocols.5	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt PROTOCOLS 5
.Os BSD 4.2
.Sh NAME
.Nm protocols
.Nd protocol name data base
.Sh DESCRIPTION
The
.Nm protocols
file contains information regarding the known protocols used in the
.Tn DARPA
Internet.  For each protocol a single line should be present
with the following information:
.Bd -unfilled -offset indent
official protocol name
protocol number
aliases
.Ed
.Pp
Items are separated by any number of blanks and/or
tab characters.  A ``#'' indicates the beginning of
a comment; characters up to the end of the line are
not interpreted by routines which search the file.
.Pp
Protocol names may contain any printable
character other than a field delimiter, newline,
or comment character.
.Sh FILES
.Bl -tag -width /etc/protocols -compact
.It Pa /etc/protocols
The
.Nm protocols
file resides in
.Pa /etc .
.El
.Sh SEE ALSO
.Xr getprotoent 3
.Sh BUGS
A name server should be used instead of a static file.
.Sh HISTORY
The
.Nm
file format appeared in
.Bx 4.2 .
