usr/src/share/man/man5/services.5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.roff%
.\"
.\"     @(#)services.5	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt SERVICES 5
.Os BSD 4.2
.Sh NAME
.Nm services
.Nd service name data base
.Sh DESCRIPTION
The
.Nm services
file contains information regarding
the known services available in the
.Tn DARPA
Internet.
For each service a single line should be present
with the following information:
.Bd -unfilled -offset indent
official service name
port number
protocol name
aliases
.Ed
.Pp
Items are separated by any number of blanks and/or
tab characters.  The port number and protocol name
are considered a single 
.Em item ;
a ``/'' is used to
separate the port and protocol (e.g. ``512/tcp'').
A ``#'' indicates the beginning of
a comment; subsequent characters up to the end of the line are
not interpreted by the routines which search the file.
.Pp
Service names may contain any printable
character other than a field delimiter, newline,
or comment character.
.Sh FILES
.Bl -tag -width /etc/services -compact
.It Pa /etc/services
The
.Nm services
file resides in
.Pa /etc .
.El
.Sh SEE ALSO
.Xr getservent 3
.Sh BUGS
A name server should be used instead of a static file.
.Sh HISTORY
The
.Nm
file format appeared in
.Bx 4.2 .
