.ref-1f134477ee3d661f07a3eec87cb3e14327e25d1c/usr/src/bin/sync/sync.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.roff%
.\"
.\"	@(#)sync.8	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt SYNC 8
.Os BSD 4
.Sh NAME
.Nm sync
.Nd force completion of pending disk writes (flush cache)
.Sh SYNOPSIS
.Nm sync
.Sh DESCRIPTION
.Nm Sync
can be called to insure that all disk writes have been completed before the
processor is halted in a way not suitably done by
.Xr reboot 8
or
.Xr halt 8 .
Generally, it is preferable to use
.Xr reboot
or
.Xr halt
to shut down the system,
as they may perform additional actions
such as resynchronizing the hardware clock
and flushing internal caches before performing a final
.Nm sync .
.Pp
.Nm Sync
utilizes the
.Xr sync 2
function call.
.Sh SEE ALSO
.Xr sync 2 ,
.Xr fsync 2 ,
.Xr halt 8 ,
.Xr reboot 8 ,
.Xr update 8
.Sh HISTORY
A
.Nm sync
command appeared in
.At v6 .
