usr/src/old/symorder/symorder.1
.\" Copyright (c) 1980, 1990 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)symorder.1	6.5 (Berkeley) %G%
.\"
.Dd 
.Dt SYMORDER 1
.Os BSD 3
.Sh NAME
.Nm symorder
.Nd rearrange name list
.Sh SYNOPSIS
.Nm symorder
.Fl t Ar symlist file
.Sh DESCRIPTION
The file
.Ar symlist
contains a list of symbols to be found in
.Ar file,
one symbol per line.
.Pp
The symbol table of
.Ar file
is updated in place;
symbols read from
.Ar symlist
are relocated to the beginning of the table and in the order given.
.Bl -tag -width flag
.It Fl t
Restrict the symbol table to the symbols listed in
.Ar symlist .
.El
.Pp
This program was specifically designed to cut down on the
overhead of getting symbols from
.Pa /vmunix.
.Sh DIAGNOSTICS
The
.Nm symorder
utility exits 0 on success, 1 if a symbol
listed in the
.Ar symlist
file was not found in the symbol
table, and >1 if an error occurs.
.Sh SEE ALSO
.Xr nm 3 ,
.Xr nlist 3 ,
.Xr strip 3
.Sh HISTORY
The
.Nm
command appeared in
.Bx 3.0 .
