.ref-1d33b1148ce80b9b3332d3e497469df7d82a8ee1/usr/src/usr.sbin/trpt/trpt.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)trpt.8	8.2 (Berkeley) %G%
.\"
.Dd 
.Dt TRPT 8
.Os BSD 4.2
.Sh NAME
.Nm trpt
.Nd transliterate protocol trace
.Sh SYNOPSIS
.Nm trpt
.Op Fl a
.Op Fl f
.Op Fl j
.Op Fl p Ar hex-address
.Op Fl s
.Op Fl t
.Oo
.Ar system Op Ar core
.Oc
.Sh DESCRIPTION
.Nm Trpt
interrogates the buffer of
.Tn TCP
trace records created
when a socket is marked for
.Dq debugging
(see
.Xr setsockopt 2 ) ,
and prints a readable description of these records.
When no options are supplied, 
.Nm trpt
prints all the trace records found in the system
grouped according to
.Tn TCP
connection protocol control
block
.Pq Tn PCB .
The following options may be used to
alter this behavior.
.Bl -tag -width Ds
.It Fl a
In addition to the normal output,
print the values of the source and destination
addresses for each packet recorded.
.It Fl f
Follow the trace as it occurs, waiting a short time for additional records
each time the end of the log is reached.
.It Fl j
Just give a list of the protocol control block
addresses for which there are trace records.
.It Fl p
Show only trace records associated with the protocol
control block at the given address
.Ar hex-address .
.It Fl s
In addition to the normal output,
print a detailed description of the packet
sequencing information.
.It Fl t
in addition to the normal output,
print the values for all timers at each
point in the trace.
.El
.Pp
The recommended use of
.Nm trpt
is as follows.
Isolate the problem and enable debugging on the
socket(s) involved in the connection.
Find the address of the protocol control blocks
associated with the sockets using the 
.Fl A
option to 
.Xr netstat 1 .
Then run
.Nm trpt
with the
.Fl p
option, supplying the associated
protocol control block addresses.
The
.Fl f
option can be used to follow the trace log once the trace is located.
If there are
many sockets using the debugging option, the
.Fl j
option may be useful in checking to see if
any trace records are present for the socket in
question.
.Pp
If debugging is being performed on a system or
core file other than the default, the last two
arguments may be used to supplant the defaults.
.Sh FILES
.Bl -tag -width /dev/kmem -compact
.It Pa /vmunix
.It Pa /dev/kmem
.El
.Sh SEE ALSO
.Xr netstat 1 ,
.Xr setsockopt 2 ,
.Xr trsp 8
.Sh DIAGNOSTICS
.Bl -tag -width Ds
.It Sy no namelist
When the system image doesn't
contain the proper symbols to find the trace buffer;
others which should be self explanatory.
.El
.Sh BUGS
Should also print the data for each input or output,
but this is not saved in the race record.
.Pp
The output format is inscrutable and should be described
here.
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
