.ref-ada4388eec962c43bf59fd5af50828587d1a448b/usr/src/sbin/savecore/savecore.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)savecore.8	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt SAVECORE 8
.Os BSD 4
.Sh NAME
.Nm savecore
.Nd "save a core dump of the operating system"
.Sh SYNOPSIS
.Nm savecore
.Fl c
.Nm savecore
.Op Fl fvz
.Op Fl N Ar system
.Ar directory
.Sh DESCRIPTION
.Nm Savecore
copies the currently running kernel and its associated core dump into
.Fa directory ,
and enters a reboot message and information about the core dump into
the system log.
.Pp
The options are as follows:
.Bl -tag -width directory
.It Fl c
Clears the dump, so that future invocations of
.Nm savecore
will ignore it.
.It Fl f
Forces a dump to be taken even if the dump doesn't appear correct or there
is insufficient disk space.
.It Fl N
Use
.Ar system
as the kernel instead of the default ``/vmunix''.
.It Fl v
Prints out some additional debugging information.
.It Fl z
Compresses the core dump and kernel (see
.Xr compress 1 ).
.El
.Pp
.Nm Savecore
checks the core dump in various ways to make sure that it is current and
that it corresponds to the currently running system.
If it passes these checks, it saves the core image in
.Ar directory Ns Pa /vmcore.#
and the system in
.Ar directory Ns Pa /vmunix.#
The ``#'' is the number from the first line of the file
.Ar directory Ns Pa /bounds ,
and it is incremented and stored back into the file each time
.Nm savecore
successfully runs.
.Pp
.Nm Savecore
also checks the available disk space before attempting to make the copies.
If there is insufficient disk space in the filesystem containing
.Ar directory ,
or if the file
.Ar directory Ns Pa /minfree
exists and the number of free kilobytes (for non-superusers) in the
filesystem after the copies were made would be less than the number
in the first line of this file, the copies are not attempted.
.Pp
If
.Nm savecore
successfully copies the kernel and the core dump, the core dump is cleared
so that future invocations of
.Nm savecore
will ignore it.
.Pp
.Nm Savecore
is meant to be called near the end of the initialization file
.Pa /etc/rc
(see
.Xr rc 8 ) .
.Sh FILES
.Bl -tag -width /vmunixxx -compact
.It Pa /vmunix
current
.Tn UNIX
.El
.Sh BUGS
The minfree code does not consider the effect of compression.
.Sh SEE ALSO
.Xr compress 1 ,
.Xr syslogd 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.1 .
