usr/src/usr.sbin/implogd/implogd.8
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)implogd.8	6.7 (Berkeley) 3/16/91
.\"
.Dd March 16, 1991
.Dt IMPLOGD 8
.Os BSD 4.2
.Sh NAME
.Nm implogd
.Nd
.Tn IMP
logger process
.Sh SYNOPSIS
.Nm implogd
.Sh DESCRIPTION
.Nm Implogd
is program which logs error messages from an
.Tn IMP ,
placing them in the file
.Pa /var/log/implog .
.Pp
Entries in the file are variable length.  Each log
entry has a fixed length header of the form:
.Bd -literal -offset indent
struct sockstamp {
	short	sin_family;
	u_short	sin_port;
	struct	in_addr sin_addr;
	time_t	sin_time;
	int	sin_len;
};
.Ed
.Pp
followed, possibly, by the message received from the
.Tn IMP .
Each time the logging process is started up it places a
time stamp entry in the file (a header with
.Ar sin_len
field set to 0).
.Pp
The logging process will catch only those messages from the
.Tn IMP
which are not processed by a protocol module, e.g. IP.
This implies the log should contain only status information such
as
.Dq Tn IMP No going down
messages,
.Dq host down
and other error messages,
and, perhaps, stray
.Tn NCP
messages.
.Sh SEE ALSO
.Xr imp 4 ,
.Xr implog 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
