usr/src/usr.sbin/sendmail/makemap/makemap.8
.\" Copyright (c) 1988, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)makemap.8	8.1 (Berkeley) %G%
.\"
.Dd November 16, 1992
.Dt MAKEMAP 8
.Os BSD 4.4
.Sh NAME
.Nm makemap
.Nd create database maps for sendmail
.Sh SYNOPSIS
.Nm
.Op Fl N
.Op Fl f
.Op Fl o
.Op Fl r
.Op Fl v
.Ar maptype
.Ar mapname
.Sh DESCRIPTION
.Nm
creates the database maps used by the keyed map lookups in
.Xr sendmail 8 .
It reads input from the standard input
and outputs them to the indicated
.Ar mapname .
.Pp
Depending on how it is compiled,
.Nm
handles up to three different database formats,
selected using the
.Ar maptype
parameter.
They may be
.Bl -tag -width Fl
.It Li dbm
DBM format maps.
This requires the
.Xr ndbm 3
library.
.It Li btree
B-Tree format maps.
This requires the new Berkeley
.Xr db 3
library.
.It Li hash
Hash format maps.
This also requires the
.Xr db 3
library.
.El
.Pp
In all cases,
.Nm
reads lines from the standard input consisting of two
words separated by white space.
The first is the database key,
the second is the value.
The value may contain
``%\fIn\fP''
strings to indicated parameter substitution.
Literal parentheses should be doubled
(``%%'').
Blank lines and lines beginning with ``#'' are ignored.
.Ss Flags
.Bl -tag -width Fl
.It Fl N
Include the null byte that terminates strings
in the map.
This must match the \-N flag in the sendmail.cf
``K'' line.
.It Fl f
Fold all upper case letters in the key
to lower case;
this is intended to mesh with the
\-f flag in the
\fBK\fP
line in sendmail.cf.
The value is not case folded.
.It Fl o
Append to an old file.
This allows you to augment an existing file.
.It Fl r
Allow replacement of existing keys.
Normally
.Nm
complains if you repeat a key,
and does not do the insert.
.It Fl v
Verbosely print what it is doing.
.El
.Sh SEE ALSO
.Xr sendmail 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.4 .
