.ref-4d568c0305b89276acf12c9f6bfae8ea44a5b7b5/usr/src/usr.bin/w/uptime.1
.\" Copyright (c) 1980, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.roff%
.\"
.\"     @(#)uptime.1	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt UPTIME 1
.Os BSD 3
.Sh NAME
.Nm uptime
.Nd show how long system has been running
.Sh SYNOPSIS
.Nm uptime
.Sh DESCRIPTION
The 
.Nm uptime
utiliity
displays the current time, the length of time the system has been up,
the number of users, and the load average of the system over the last
1, 5, and 15 minutes.
.Sh FILES
.Bl -tag -width /vmunix
.It Pa /vmunix
system name list
.El
.Sh SEE ALSO
.Xr w 1
.Sh HISTORY
The
.Nm
command appeared in
.Bx 3.0 .
