dspinellis/unix-history-repo/.ref-386BSD-0.1-patchkit/usr/src/sbin/dump/rdump.8
.\" Copyright (c) 1983, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)rdump.8	6.3 (Berkeley) 3/16/91
.\"
.Dd March 16, 1991
.Dt RDUMP 8
.Os BSD 4.2
.Sh NAME
.Nm rdump
.Nd file system dump across the network
.Sh SYNOPSIS
.Nm rdump
.Oo
.Ar flags
.Op Ar argument ...
.Ar filesystem
.Oc
.Sh DESCRIPTION
.Nm Rdump
remotely backs up files across a network in the same manner as
.Xr dump 8
locally backs up files.
The command is identical in operation to
.Xr dump 8
except the 
.Cm f
key must be specified and the file
.Ar argument
supplied should be of the form
.Pa machine:device .
.Pp
.Nm Rdump
creates a remote server,
.Xr rmt ,
on the client machine to access the tape
device.
.Sh SEE ALSO
.Xr dump 8 ,
.Xr rmt 8
.Sh DIAGNOSTICS
Same as 
.Xr dump 8
with a few extra related to the network.
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
