.ref-1f134477ee3d661f07a3eec87cb3e14327e25d1c/usr/src/old/mount_lofs/mount_lofs.8
.\"
.\" Copyright (c) 1992, 1993, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\" All rights reserved.
.\"
.\" This code is derived from software donated to Berkeley by
.\" Jan-Simon Pendry.
.\"
.\" %sccs.include.redist.roff%
.\"
.\"	@(#)mount_lofs.8	8.2 (Berkeley) %G%
.\"
.\"
.Dd 
.Dt MOUNT_LOFS 8
.Os BSD 4.4
.Sh NAME
.Nm mount_lofs
.Nd mount a virtual copy of an existing filesystem sub-tree
.Sh SYNOPSIS
.Nm mount_lofs
.Op Fl o Ar options
.Ar target
.Ar mount-point
.Sh DESCRIPTION
The
.Nm mount_lofs
command makes a sub-tree of an existing filesystem visible
in another part of the global filesystem namespace.
This allows existing files and directories to be accessed
using a different pathname.
.Pp
The primary differences between a virtual copy of the filesystem
and a symbolic link are that
.Xr getcwd 3
functions correctly in the virtual copy, and that other filesystems
may be mounted on the virtual copy without affecting the original.
A different device number for the virtual copy is returned by
.Xr stat 2 ,
but in other respects it is indistinguishable from the original.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl o
Options are specified with a
.Fl o
flag followed by a comma separated string of options.
See the
.Xr mount 8
man page for possible options and their meanings.
.Sh SEE ALSO
.Xr mount 8
.Sh HISTORY
The
.Nm mount_lofs
utility first appeared in 4.4BSD.
