.ref-26af45907971fe96fc69c497470a08ea8542e499/usr/src/share/man/man4/man4.tahoe/cy.4
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)cy.4	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt CY 4 tahoe
.Os BSD 4.3t
.Sh NAME
.Nm cy
.Nd Cipher/tapemaster magtape interface
.Sh SYNOPSIS
.Cd "controller cy0 at vba? csr 0xffff4000 vector cyintr"
.Cd "device yc0 at cy0 drive 0"
.Sh DESCRIPTION
The Cipher
.Tn F880 ,
.Tn M990 Ns / Tapemaster
combination provides a standard tape drive
interface as described in
.Xr mt 4 .
The Cipher
.Tn F880
tape drive operates at 1600 or 3200
.Tn BPI \-
controlled by a switch on the drive. 
The Cipher
.Tn M990
operates at 1600, 3200 or 6250
.Tn BPI \-
controlled by switches on the front of the drive.
.Pp
The Tapemaster controller board is actually a Multibus controller
accessed through a Halversa Multibus to
.Tn VERSAbus
converter card.
.Sh DIAGNOSTICS
.Bl -diag
.It cy%d: %dkb buffer.
The formatter was found to have a
.Ql %d
kilobyte buffer during autoconfiguration.
.It cy%d: timeout or err during init, status=%b.
The controller
timed out or an error occurred on a nop command during autoconfiguration;
the controller may be hung.
.It cy%d: configuration failure, status=%b.
The controller
timed out or an error occurred on a configure command during
autoconfiguration; the controller may be hung.
.It yc%d: no write ring.
An attempt was made to write on the tape drive
when no write ring was present; this message is written on the terminal of
the user who tried to access the tape.
.It yc%d: not online.
An attempt was made to access the tape while it
was offline; this message is written on the terminal of the user
who tried to access the tape.
.It cy%d: i/o size too large.
A read or a write request exceeded the
maximum transfer size for the controller \- 32 kilobytes; this message
is written on the terminal of the user who made the read or write request.
.It yc%d: hard error bn%d status=%b.
A tape error occurred
at block
.Em bn ;
the cy error register is
printed in hexadecimal with the bits symbolically decoded.  Any error is
fatal on non-raw tape; when possible the driver will have retried
the operation which failed several times before reporting the error.
For known errors, the trailing
.Ql %s
is one of the following:
.Pp
.Bl -diag -offset indent -compact
.It timeout, timeout1, timeout2, timeout3, timeout4.
Time out errors; this may be due to trying to read a blank tape
or the controller failing to interrupt or the drive dropping off-line.
.It non-existent memory.
A controller transfer to memory timed out.
.It blank tape.
The controller detected a blank tape when
data was expected.
.It micro-diagnostic, missing diagnostic jumper.
An error occurred in the micro-diagnostics or
the diagnostic mode jumper was not installed while attempting to execute
a diagnostics command.
.It eot/bot detected.
The controller unexpectedly encountered
end-of-tape or beginning-of-tape during an operation.
.It retry unsuccessful.
An error occurred which could not be recovered by repeated retries.
.It fifo over/under-flow.
The controller was unable to transfer data to the drive fast enough.
This usually occurs because a transfer was performed without using the
controller's internal buffer.
.It drive to controller parity error.
A parity error was detected by the controller in data transferred
between the drive and the controller's internal buffer.
.It prom checksum.
The controller thinks its
.Tn PROM
is corrupted.
.It time out tape strobe (record length error).
The controller timed out while looking for an inter-record gap.
This usually occurs because the records on the tape are larger than
expected (or can be handled).
.It tape not ready.
The drive does not respond; usually the power has been turned off
or a cable has come off.
.It write protected.
A write ring was present in the tape when a write was attempted.
.It invalid link pointer.
An invalid pointer was encountered in a tape parameter block.
.It unexpected file mark.
A tape file mark was encountered while trying to read or space.
.It invalid byte count.
An invalid byte count parameter was encountered in a tape parameter
block.
.It unidentified hardware error.
.It streaming terminated.
These should not happen.
.El
.Pp
.It yc%d: lost interrupt.
The controller failed to respond with an interrupt signifying completion
of the current command.  The system will attempt to abort the
outstanding command and reset the controller.
.Pp
.It cy%d: reset failed.
The system was unable to reset the controller.  This is normally preceded
by another message from the driver.
.El
.Sh SEE ALSO
.Xr mt 1 ,
.Xr tar 1 ,
.Xr mtio 4
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.3 tahoe .
.Sh BUGS
The controller supports only 20-bit addresses.  The only way the
system can insure the controller will be able to address data
to be transferred
is to copy it into an intermediate buffer allocated in the first megabyte
of system memory.
