.ref-BSD-4_3_Reno/usr/src/usr.bin/nfsstat/nfsstat.1
.\" Copyright (c) 1989, 1990 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms are permitted provided
.\" that: (1) source distributions retain this entire copyright notice and
.\" comment, and (2) distributions including binaries display the following
.\" acknowledgement:  ``This product includes software developed by the
.\" University of California, Berkeley and its contributors'' in the
.\" documentation or other materials provided with the distribution and in
.\" all advertising materials mentioning features or use of this software.
.\" Neither the name of the University nor the names of its contributors may
.\" be used to endorse or promote products derived from this software without
.\" specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR IMPLIED
.\" WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\"
.\"     @(#)nfsstat.1	5.3 (Berkeley) 7/24/90
.\"
.Dd July 24, 1990
.Dt NFSSTAT 1
.Os BSD 4.4
.Sh NAME
.Nm nfsstat
.Nd report NFS statistics
.Sh SYNOPSIS
.Nm nfsstat
.Ob
.Ar interval
.Op Ar system Op Ar corefile
.Oe
.Sh DESCRIPTION
.Nm Nfsstat
delves into the system and normally reports certain statistics kept about
.Li NFS
client and server activity.
If
.Ar interval
is specified, then successive lines are summaries over the last
.Ar interval
seconds.
The command
.Dq Li nfsstat 5
will print what
.Li NFS
is doing every five seconds.
.Pp
A second argument is taken
to be the file containing the system's namelist.
Otherwise,
.Pa /vmunix
is used.
A third argument tells
.Nm nfsstat
where to look for
.Pa core  .
Otherwise,
.Pa /dev/kmem
is used.
.Sh FILES
.Dw /dev/kmem
.Di L
.Dp Pa /dev/kmem
.Dp Pa /vmunix
.Dp
.Sh SEE ALSO
.Xr netstat  1  ,
.Xr vmstat  1
.Sh HISTORY
.Nm Nfsstat
appears in 4.4 BSD.
