.ref-1d33b1148ce80b9b3332d3e497469df7d82a8ee1/usr/src/sbin/newlfs/newlfs.8
.\" Copyright (c) 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)newlfs.8	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt NEWLFS 8
.Os BSD 4.4
.Sh NAME
.Nm newlfs
.Nd construct a new LFS file system
.Sh SYNOPSIS
.Nm newlfs
.Fl L
.Op Ar newlfs-options
.Ar special
.Sh DESCRIPTION
.Nm Newlfs
builds a log-structured file system on the specified special
device basing its defaults on the information in the disk label.
(Before running 
.Nm newlfs
the disk must be labeled using 
.Xr disklabel 8 .)
.Pp
The following options define the general layout policies.
.Bl -tag -width Fl
.It Fl B
The logical segment size of the file system in bytes.
.It Fl b Ar block-size
The block size of the file system in bytes.
.It Fl L
Create a log-structured file system (LFS).
This flag is currently required.
.It Fl m Ar free space \&%
The percentage of space reserved from normal users; the minimum
free space threshold.  The default value used is 10%.
See
.Xr tunefs 8
for more details on how to set this option.
.It Fl s Ar size
The size of the file system in sectors.
.El
.Sh SEE ALSO
.Xr disktab 5 ,
.Xr fs 5 ,
.Xr dumplfs 8 ,
.Xr disklabel 8 ,
.Xr diskpart 8 ,
.Xr tunefs 8
.Rs
.%A M. McKusick
.%A W. Joy
.%A S. Leffler
.%A R. Fabry
.%T A Fast File System for UNIX ,
.%J ACM Transactions on Computer Systems 2
.%V 3
.%P pp 181-197
.%D August 1984
.%O (reprinted in the BSD System Manager's Manual)
.Re
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.4 .
