dspinellis/unix-history-repo/.ref-386BSD-0.1-patchkit/usr/src/libexec/uucp/uucico.8
''' $Id: uucico.8,v 1.7 1992/04/01 21:11:19 ian Rel $
''' $Log: uucico.8,v $
''' Revision 1.7  1992/04/01  21:11:19  ian
''' Cleaned up a bit, updated -x switch
'''
''' Revision 1.6  1992/03/28  04:34:11  ian
''' David J. MacKenzie: change .TP5 to .TP 5; also updated to 1.03
'''
''' Revision 1.5  1992/03/08  17:08:20  ian
''' Ted Lindgreen: ignore -u option
'''
''' Revision 1.4  1992/02/27  05:40:54  ian
''' T. William Wells: detach from controlling terminal, handle signals safely
'''
''' Revision 1.3  1992/01/20  23:52:23  ian
''' Change to version 1.02
'''
''' Revision 1.2  1991/12/18  05:12:00  ian
''' Added -l option to uucico to prompt for login name once and then exit
'''
''' Revision 1.1  1991/12/14  19:05:30  ian
''' Initial revision
'''
'''
.TH uucico 8 "Taylor UUCP 1.03"
.SH NAME
uucico \- UUCP file transfer daemon
.SH SYNOPSIS
.B uucico
[ options ]
.SH DESCRIPTION
The
.I uucico
daemon processes file transfer requests queued by
.I uucp
(1) and
.I uux
(1).  It is started when
.I uucp
or
.I uux
is run (unless they are given the
.B \-r
option).  It is also typically started periodically using
entries in the
.I crontab
table(s).

When invoked with the
.B \-r1
option or the
.B \-s
or
.B \-S
option, the daemon will place a call to a remote system, running in
master mode.
Otherwise the daemon will start in slave mode, accepting a
call from a remote system.  Typically a special login name will be set
up for UUCP which automatically invokes
.I uucico
when a call is made.

When
.I uucico
terminates, it invokes the
.I uuxqt
(8) daemon, unless the
.B \-q
option is given;
.I uuxqt
(8) executes any work orders created by
.I uux
(1) on a remote system, and any work orders created locally which have
received remote files for which they were waiting.

If a call fails,
.I uucico
will normally refuse to retry the
call until a certain (configurable) amount of time
has passed.  This may be overriden by the
.B -f
or the
.B -S
option.

The
.B \-l
or
.B \-e
option may be used to force
.I uucico
to produce its own prompts of "login: " and "Password:".  When another
daemon calls in, it will see these prompts and log in as usual; the
login name and password will be checked against a separate list kept
specially for
.I uucico
rather than the
.I /etc/passwd
file.  The
.B \-l
option will prompt once and then exit.  The
.B \-e
option will prompt again after the first session is over; in this mode
.I uucico
will permanently control a port.

If
.I uucico
receives a SIGQUIT, SIGTERM or SIGPIPE signal, it will cleanly abort
any current conversation with a remote system and exit.  If it
receives a SIGHUP signal it will abort any current conversation, but
will continue to place calls to (if invoked with
.B \-r1)
and accept calls from (if invoked with
.B \-e)
other systems.  If it receives a
SIGINT signal it will finish the current conversation, but will not
place or accept any more calls.
.SH OPTIONS
The following options may be given to
.I uucico.
.TP 5
.B \-r1
Start in master mode (call out to a system); implied by
.B \-s
or
.B \-S.  If no system is specified, 
call any system for which work is
waiting to be done.
.TP 5
.B \-r0
Start in slave mode.  This is the default.
.TP 5
.B \-s system
Call the named system.
.TP 5
.B \-S system
Call the named system, ignoring any required wait.
.TP 5
.B \-f
Ignore any required wait for any systems to be called.
.TP 5
.B \-l
Prompt for login name and password using "login: " and "Password:".
This allows
.I uucico
to be easily run from
.I inetd
(8).  The login name and password are checked against the UUCP
password file, which has no connection to the file
.I /etc/passwd.
.TP 5
.B \-p port
Specify a port to call out on or to listen to.  In slave mode, this
implies
.B \-e.
.TP 5
.B \-e
Enter endless loop of login/password prompts and slave mode daemon
execution.  The program will not stop by itself; you must use
.I kill
(1) to shut it down.
.TP 5
.B \-w
After calling out (to a particular system when
.B \-s
or 
.B \-S
is specifed, or to all systems which have work when
.B \-r1
is specifed), begin an endless loop as with
.B \-e.
.TP 5
.B \-q
Do not start the
.I uuxqt
(8) daemon when finished.
.TP 5
.B \-D
Do not detach from the controlling terminal.  Normally
.I uucico
detaches from the terminal before each call out to another system and
before invoking
.I uuxqt.
This option prevents this.
.TP 5
.B \-x type, \-X type
Turn on particular debugging types.  The following types are
recognized: abnormal, chat, handshake, uucp-proto, proto, port,
config, spooldir, execute, incoming, outgoing.  

Multiple types may be given, separated by commas, and the
.B \-x
option may appear multiple times.  A number may also be given, which
will turn on that many types from the foregoing list; for example,
.B \-x 2
is equivalent to
.B \-x abnormal,chat.

The debugging output is sent to the debugging file, usually one of
/usr/spool/uucp/Debug, /usr/spool/uucp/DEBUG, or
/usr/spool/uucp/.Admin/audit.local.
.TP 5
.B \-I file
Set configuration file to use.  This option may not be available,
depending upon how
.I uucico
was compiled.
.TP 5
.B \-u login
This option is ignored.  It is only included because some versions of
uucpd invoke
.I uucico
with it.
.SH FILES
The file names may be changed at compilation time or by the
configuration file, so these are only approximations.

.br
/usr/lib/uucp/config - Configuration file.
.br
/usr/lib/uucp/passwd - Default UUCP password file.
.br
/usr/spool/uucp -
UUCP spool directory.
.br
/usr/spool/uucp/Log -
UUCP log file.
.br
/usr/spool/uucppublic -
Default UUCP public directory.
.br
/usr/spool/uucp/Debug -
Debugging file.
.SH SEE ALSO
kill(1), uucp(1), uux(1), uuxqt(8)
.SH AUTHOR
Ian Lance Taylor
(ian@airs.com or uunet!airs!ian)
