dspinellis/unix-history-repo/.ref-386BSD-0.1-patchkit/usr/src/libexec/uucp/uucp.1
''' $Id: uucp.1,v 1.5 1992/04/01 21:11:19 ian Rel $
''' $Log: uucp.1,v $
''' Revision 1.5  1992/04/01  21:11:19  ian
''' Cleaned up a bit, updated -x switch
'''
''' Revision 1.4  1992/03/28  04:34:11  ian
''' David J. MacKenzie: change .TP5 to .TP 5; also updated to 1.03
'''
''' Revision 1.3  1992/02/29  04:07:08  ian
''' Added -j option to uucp and uux
'''
''' Revision 1.2  1992/01/20  23:52:23  ian
''' Change to version 1.02
'''
''' Revision 1.1  1991/12/14  19:05:20  ian
''' Initial revision
'''
'''
.TH uucp 1 "Taylor UUCP 1.03"
.SH NAME
uucp \- Unix to Unix copy
.SH SYNOPSIS
.B uucp
[ options ] source-file destination-file
.PP
.B uucp
[ options ] source-file... destination-directory
.SH DESCRIPTION
The
.I uucp
command copies files between systems.  Each
.I file
argument is either a pathname on the local machine or is of the form
.IP
system!path
.LP
which is interpreted as being on a remote system.
In the first form, the contents of the first file are copied to the
second.  In the second form, each source file is copied into the
destination directory.

Any pathname that does not begin with / or ~ will be appended to the
current directory; this resulting path may not exist on a remote
system.  A pathname beginning with a simple ~ starts at the UUCP
public directory; a pathname beginning with ~name starts at the home
directory of the named user.  The ~ is interpreted on the appropriate
system.  Note that some shells will interpret a simple ~ to the local
home directory before 
.I uucp
sees it; to avoid this the ~ must be quoted.

Shell metacharacters ? * [ ] are interpreted on the appropriate
system, assuming they are quoted to prevent the shell from
interpreting them first.

The copy does not take place immediately, but is queued up for the
.I uucico
(8) daemon; the daemon is started immediately unless the 
.B \-r
switch is given.  In any case, the next time the remote system is called the
file(s) will be copied.
.SH OPTIONS
The following options may be given to
.I uucp.
.TP 5
.B \-c
Do not copy local source files to the spool directory.  If they are
removed before being processed by the
.I uucico
(8) daemon, the copy will fail.  The files must be readable by the
.I uucico
(8) daemon, and by the invoking user.
.TP 5
.B \-C
Copy local source files to the spool directory.  This is the default.
.TP 5
.B \-d
Create all necessary directories when doing the copy.  This is the
default.
.TP 5
.B \-f
If any necessary directories do not exist for the destination path,
abort the copy.
.TP 5
.B \-g grade
Set the grade of the file transfer command.  Jobs of a higher grade
are executed first.  Grades run 0 ... 9 A ... Z a ... z from high to
low.
.TP 5
.B \-m
Report completion or failure of the file transfer by
.I mail
(1).
.TP 5
.B \-n user
Report completion or failure of the file transfer by
.I mail
(1) to the named
user on the remote system.
.TP 5
.B \-r
Do not start
.I uucico
(8) daemon immediately; merely queue up the file transfer for later
execution.
.TP 5
.B \-j
Print jobid on standard output.  The job may be
later cancelled by passing the jobid to the
.B \-k
switch of
.I uustat
(1).
It is possible for some complex operations to produce more than one
jobid, in which case each will be printed on a separate line.  For
example
.EX
uucp sys1!~user1/file1 sys2!~user2/file2 /usr/spool/uucppublic
.EE
will generate two separate jobs, one for the system
.I sys1
and one for the system
.I sys2.
.TP 5
.B \-x type
Turn on particular debugging types.  The following types are
recognized: abnormal, chat, handshake, uucp-proto, proto, port,
config, spooldir, execute, incoming, outgoing.  Only abnormal, config,
spooldir and execute are meaningful for
.I uucp.

Multiple types may be given, separated by commas, and the
.B \-x
option may appear multiple times.  A number may also be given, which
will turn on that many types from the foregoing list; for example,
.B \-x 2
is equivalent to
.B \-x abnormal,chat.
.TP 5
.B \-I file
Set configuration file to use.  This option may not be available,
depending upon how
.I uucp
was compiled.
.SH FILES
The file names may be changed at compilation time or by the
configuration file, so these are only approximations.

.br
/usr/lib/uucp/config - Configuration file.
.br
/usr/spool/uucp -
UUCP spool directory.
.br
/usr/spool/uucp/Log -
UUCP log file.
.br
/usr/spool/uucppublic -
Default UUCP public directory.
.SH SEE ALSO
mail(1), uux(1), uustat(1), uucico(8)
.SH BUGS
Files can not be copied across multiple systems.

Some of the options are dependent on the capabilities of the
.I uucico
(8) daemon on the remote system.

The 
.I \-n
and
.I \-m
switches do not work when transferring a file from one remote system
to another.

File modes are not preserved, except for the execute bit.  The
resulting file is owned by the uucp user.
.SH AUTHOR
Ian Lance Taylor
(ian@airs.com or uunet!airs!ian)
