dspinellis/unix-history-repo/.ref-386BSD-0.1-patchkit/usr/src/usr.sbin/keymap/keymap/keymap.8
.\" Copyright (c) 1983, 1990 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)keymap.8	6.8 (Contributed to 386bsd) 8/01/92
.\"
.Dd August 1, 1992
.Dt KEYMAP 8
.Os BSD 4.2
.Sh NAME
.Nm keymap
.Nd list and change keyboard settings
.Sh SYNOPSIS
.Nm keymap
.Op Fl l 
.Op Fl t Ns Ar +/-
.Op Fl d Ar delay
.Op Fl r Ar rate
.Op Fl m Ar keyboardmap
.Op Fl s Ar screensave
.Nm keymap
.Op Fl T
.Nm keymap
.Op Fl a Ar keystr Ar keycode
.Sh DESCRIPTION
.Nm keymap
allows listing of current keyboard map (
.Xr kbd 4 ,
) loading of a new keyboard map, and enabling, disabling and modification
of actual key repetition rate and delay.
.Pp
The following options are available:
.Bl -tag -width flag
.It Fl l
Displays the current keymap. Notice that when
.Ar keyboardmap 
is given, 
.Fl l
returns the setting before the new map is set.
.It Fl t Ns Ar +/-
This enables (
.Ar +
) or disables (
.Ar -
) the repetition of keys (typematic). Key repetition is a feature 
built into the keyboard itself. After a specified
.Fl delay
the last key that is hold down is repeatedly sent with a specified
.Fl rate.
.It Fl d Ar delay
Specifies the delay after which the last key will be repeated. Valid 
values are 0..3, corresponding to delays of 250,500,750,1000 ms.
.It Fl r Ar rate
Specifies the repetition rate. Valid argument values are 0..31, with
0 being the fastest (~30 keys/sec) and 31 being the slowest (~2 keys/sec).
The formula to translate this value into a rate in nonlinear.
.It Fl m Ar keyboardmap
When this optional argument is given, the keyboard capability database
.Xr keycap 5
is searched for the entry
.Ar keyboardmap
and the corresponding entry is loaded.
.It Fl s Ar screensave
Specifies the timeout value for the screensaver function. The time has to
be given in seconds, e.g. 600 describes a delay of 10 minutes. The
value 0 disables the screen saver entirely. The default value the system
is started with is 10 minutes. Screen saving is suspended when the
XServer (see
.Xr X386
) is active.
.Sh FILES
.Bl -tag -width /usr/share/misc/keycap -compact
.It Pa /usr/share/misc/keycap
Keyboard capabilities data base.
.It Pa /dev/kbd
Keyboard raw device.
.El
.Sh SEE ALSO
.Xr kbd 4 ,
.Xr keycap 5
.Sh BUGS
.Nm Keymap
detects several inconsistencies in the
.Xr keycap 5
database. Processing is stopped in case of error. The keyboard remain in
an undefined state. To restore a defined setting, execute
.Bd -literal -offset indent
keymap -m default
.Ed
.Pp
.Sh HISTORY
.Nm Keymap
was developed from scratch for 386bsd.
