usr/src/old/flcopy/flcopy.8
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)flcopy.8	5.3 (Berkeley) 9/8/91
.\"
.Dd September 8, 1991
.Dt FLCOPY 8
.Os BSD 4
.Sh NAME
.Nm flcopy
.Nd floppy copy
.Sh SYNOPSIS
.Nm flcopy
.Op Fl hr
.Op Fl f Ar file
.Op Fl t Ar ntracks
.Sh DESCRIPTION
.Nm Flcopy
copies the console floppy disk
.Dq Pa /dev/floppy
to a file in the
current directory, named
.Dq Pa floppy .
The user is then prompted to change the floppy, and enter a carriage
return when done.
When a carriage return is entered,
.Nm flcopy
copies the file out to the floppy disk.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl f
Use 
.Ar file
instead of ``/dev/floppy''.
.It Fl h
Cause
.Nm flcopy
to copy a file named ``floppy'' in the current directory to
the console floppy disk.
.It Fl r
Cause
.Nm flcopy
to copy the floppy to the current directory and then quit.
.It Fl t
Copy only the first 
.Ar ntracks
tracks.
.El
.Sh FILES
.Bl -tag -width /dev/floppy  -compact
.It Pa floppy
Temporary file name.
.It Pa /dev/floppy
Default floppy device.
.El
.Sh SEE ALSO
.Xr crl 4 ,
.Xr fl 4 ,
.Xr rx 4 ,
.Xr tu 4 ,
.Xr arff 8 ,
.Xr rxformat 8
.Sh BUGS
Device errors are handled ungracefully.
