.ref-74d46f0b6764aabf4a10b0386f1dceec1208bdd4/usr/src/sbin/dumpfs/dumpfs.8
.\" Copyright (c) 1983, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)dumpfs.8	6.2 (Berkeley) %G%
.\"
.Dd 
.Dt DUMPFS 8
.Os BSD 4.2
.Sh NAME
.Nm dumpfs
.Nd dump file system information
.Sh SYNOPSIS
.Nm dumpfs
.Op Ar filesys No \&| Ar device
.Sh DESCRIPTION
.Nm Dumpfs
prints out the super block and cylinder group information
for the file system or special device specified.
The listing is very long and detailed.  This
command is useful mostly for finding out certain file system
information such as the file system block size and minimum
free space percentage.
.Sh SEE ALSO
.Xr fs 5 ,
.Xr disktab 5 ,
.Xr disklabel 8 ,
.Xr tunefs 8 ,
.Xr newfs 8 ,
.Xr fsck 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
