.ref-26af45907971fe96fc69c497470a08ea8542e499/usr/src/share/man/man4/man4.vax/tu.4
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)tu.4	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt TU 4 vax
.Os BSD 4
.Sh NAME
.Nm tu
.Nd
.Tn VAX-11/730
and
.Tn VAX-11/750
.Tn TU58
console cassette interface
.Sh SYNOPSIS
.Cd "options MRSP"
(for
.Tn VAX-11/750 Ns 's
with an
.Tn MRSP
prom)
.Sh DESCRIPTION
The
.Nm tu
interface provides access to the
.Tn VAX
11/730 and 11/750
.Tn TU58
console
cassette drive(s).  
.Pp
The interface supports only block
.Tn I/O
to the
.Tn TU58
cassettes.
The devices are normally manipulated with the 
.Xr arff 8
program using the ``f'' and ``m'' options.
.Pp
The device driver is automatically included when a
system is configured to run on an 11/730 or 11/750.
.Pp
The
.Tn TU58
on an 11/750 uses the Radial Serial Protocol
.Pq Tn RSP
to communicate with the cpu over a serial line.  This 
protocol is inherently unreliable as it has no flow
control measures built in.  On an 11/730 the Modified
Radial Serial Protocol is used.  This protocol incorporates
flow control measures which insure reliable data transfer
between the cpu and the device.  Certain 11/750's have
been modified to use the
.Tn MRSP
prom used in the 11/730.
To reliably use the console
.Tn TU58
on an 11/750 under
.Tn UNIX ,
the
.Tn MRSP
prom is required.  For those 11/750's without
an
.Tn MRSP
prom, an unreliable but often
useable interface has been developed.
This interface uses an assembly language ``pseudo-dma'' routine
to minimize the receiver interrupt service latency.
To include this code in
the system, the configuration must
.Em not
specify the
system will run on an 11/730 or use an
.Tn MRSP
prom.
This unfortunately makes it impossible to configure a
single system which will properly handle
.Tn TU58 Ns 's
on both an 11/750
and an 11/730 (unless both machines have
.Tn MRSP
proms).
.Sh FILES
.Bl -tag -width /dev/tu0xx -compact
.It Pa /dev/tu0
.It Pa /dev/tu1
(only on a
.Tn VAX Ns \-11/730)
.El
.Sh DIAGNOSTICS
.Bl -diag
.It tu%d: no bp, active %d.
A transmission complete interrupt was received with no outstanding
.Tn I/O
request.  This indicates a hardware problem.
.Pp
.It "tu%d protocol error, state=%s, op=%x, cnt=%d, block=%d."
The driver entered an illegal state.  The information printed
indicates the illegal state, operation currently being executed,
the
.Tn I/O
count, and the block number on the cassette.
.Pp
.It "tu%d receive state error, state=%s, byte=%x."
The driver entered an illegal state in the receiver finite
state machine.  The state is shown along with the control
byte of the received packet.
.Pp
.It tu%d: read stalled.
A timer watching the controller detected no interrupt for
an extended period while an operation was outstanding.
This usually indicates that one or more receiver interrupts
were lost and the transfer is restarted (11/750 only).
.Pp
.It tu%d: hard error bn%d, pk_mod %o.
The device returned a status code indicating a hard error. The
actual error code is shown in octal. No retries are attempted
by the driver.
.El
.Sh SEE ALSO
.Xr arff 8
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.1 .
.Sh BUGS
The
.Tn VAX Ns \-11/750
console interface without
.Tn MRSP
prom is unuseable
while the system is multi-user; it should be used only with
the system running single-user and, even then, with caution.
