.ref-4d568c0305b89276acf12c9f6bfae8ea44a5b7b5/usr/src/share/man/man8/rc.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)rc.8	8.2 (Berkeley) %G%
.\"
.Dd 
.Dt RC 8
.Os BSD 4
.Sh NAME
.Nm rc
.Nd command script for auto\-reboot and daemons
.Sh SYNOPSIS
.Nm rc
.Nm rc.local
.Sh DESCRIPTION
.Nm Rc
is the command script which controls the automatic reboot and
.Nm rc.local
is the script holding commands which are pertinent only
to a specific site.
.Pp
When an automatic reboot is in progress,
.Nm rc
is invoked with the argument
.Em autoboot .
The first portion of
.Nm rc
runs an
.Xr fsck 8
with option
.Fl p
to ``preen'' all the disks of minor inconsistencies resulting
from the last system shutdown and to check for serious inconsistencies
caused by hardware or software failure.
If this auto-check and repair succeeds, then the second part of
.Nm rc
is run.
.Pp
The second part of
.Nm rc ,
which is run after an auto-reboot succeeds and also if
.Nm rc
is invoked when a single user shell terminates (see
.Xr init 8 ) ,
starts all the daemons on the system, preserves editor files
and clears the scratch directory
.Pa /tmp .
.Pp
.Nm Rc.local
is executed immediately before any other commands after a successful
.Xr fsck .
Normally, the first commands placed in the
.Nm rc.local
file define the machine's name, using
.Xr hostname 1 ,
and save any possible core image that might have been
generated as a result of a system crash, with
.Xr savecore 8 .
The latter command is included in the
.Nm rc.local
file because the directory in which core dumps are saved
is usually site specific.
.Pp
Following tradition, the startup files
.Nm rc
and
.Nm rc.local
reside in
.Pa /etc .
.Sh SEE ALSO
.Xr init 8 ,
.Xr reboot 8 ,
.Xr savecore 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.0 .
