usr/src/sbin/clri/clri.8
.\" Copyright (c) 1980, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\"	%sccs.include.redist.man%
.\"
.\"	@(#)clri.8	8.2 (Berkeley) %G%
.\"
.Dd 
.Dt CLRI 8
.Os BSD 4
.Sh NAME
.Nm clri
.Nd clear an inode
.Sh SYNOPSIS
.Nm clri
.Ar special_device inode_number ...
.Sh DESCRIPTION
.Bf -symbolic
.Nm Clri
is obsoleted for normal file system repair work by
.Xr fsck 8 .
.Ef
.Pp
.Nm Clri
zeros out the inodes with the specified inode number(s)
on the filesystem residing on the given
.Ar special_device .
The
.Xr fsck 8
utility is usually run after
.Nm clri
to reclaim the zero'ed inode(s) and the
blocks previously claimed by those inode(s).
Both read and write permission are required on the specified
.Ar special_device .
.Pp
The primary purpose of this routine
is to remove a file which
for some reason is not being properly handled by
.Xr fsck 8 .
Once removed,
it is anticipated that
.Xr fsck 8
will be able to clean up the resulting mess.
.Sh "SEE ALSO"
.Xr fsck 8 ,
.Xr fsdb 8 ,
.Xr icheck 8 ,
.Xr ncheck 8
.Sh BUGS
If the file is open, the work of
.Nm clri
will be lost when the inode is written back to disk from the inode cache.
