.ref-845a45a641b570c4164b05f649aca9a6fdddbe6e/usr/src/share/man/man4/man4.vax/dz.4
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)dz.4	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt DZ 4 vax
.Os BSD 4
.Sh NAME
.Nm dz
.Nd
.Tn DZ-11
multiplexer device interface
.Sh SYNOPSIS
.Cd "device dz0 at uba0 csr 0160100 vector dzrint dzxint"
.Sh DESCRIPTION
A
.Tn DZ-11
provides 8 communication lines with partial modem control,
adequate for
.Tn UNIX
dialup use.
.Pp
An optional argument
.Ar flags
may be supplied with the device specification
in the config file indicating
that the line corresponding to
bit number
.Ar i
is not properly
connected, and should be treated as hard-wired with carrier
always present.  Thus specifying
.Ql flags 0x04
for
.Li dz0
would cause line
.Pa tty02
to be treated in this way.
.Pp
Normal I/O
control parameters for individual lines are managed by
.Xr ioctl 2
calls.
Line speeds may be initiated via
the
.Xr ttys 5
file,
.Xr stty 1
or
.Xr ifconfig 8
to name a few,
see
.Xr tty 4 .
.Pp
The
.Nm dz
driver monitors the rate of input on each board,
and switches between the use of character-at-a-time interrupts
and input silos.
While the silo is enabled during periods of high-speed input,
the driver polls for input 30 times per second.
.Sh FILES
.Bl -tag -width /dev/tty[0-9][0-9]xx -compact
.It Pa /dev/tty[0-9][0-9]
.It Pa /dev/ttyd[0-9a-f]
dialups
.El
.Sh DIAGNOSTICS
.Bl -diag
.It dz%d: silo overflow .
The 64 character input silo overflowed
before it could be serviced.  This can happen if a hard error occurs
when the
.Tn CPU
is running with elevated priority, as the system will
then print a message on the console with interrupts disabled.
It is not serious.
.El
.Sh SEE ALSO
.Xr stty 1 ,
.Xr tty 4 ,
.Xr ttys 5 ,
.Xr getty 8
.Sh HISTORY
A
.Nm
driver appeared in
.At 32v .
