.ref-845a45a641b570c4164b05f649aca9a6fdddbe6e/usr/src/share/man/man4/man4.vax/mt.4
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)mt.4	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt MT 4 vax
.Os BSD 4
.Sh NAME
.Nm mt
.Nd
.Tn TM78 Ns / Tn TU-78
.Tn MASSBUS
magtape interface
.Sh SYNOPSIS
.Cd "master mt0 at mba? drive ? tape mu0 at mt0 slave 0"
.Sh DESCRIPTION
The
.Tn TM78 Ns / Tn TU-78
combination provides a standard tape drive
interface as described in
.Xr mtio 4 .
Only 1600 and 6250
.Tn BPI
are supported; the
.Tn TU-78
runs at 125
.Tn IPS
and autoloads tapes.
.Sh DIAGNOSTICS
.Bl -diag
.It mu%d: no write ring.
An attempt was made to write on the tape drive
when no write ring was present; this message is written on the terminal of
the user who tried to access the tape.
.Pp
.It mu%d: not online.
An attempt was made to access the tape while it
was offline; this message is written on the terminal of the user
who tried to access the tape.
.Pp
.It "mu%d: can't change density in mid-tape."
An attempt was made to write
on a tape at a different density than is already recorded on the tape.
This message is written on the terminal of the user who tried to switch
the density.
.Pp
.It "mu%d: hard error bn%d mbsr=%b er=%x ds=%b."
A tape error occurred
at block
.Em bn ;
the mt error register and drive status register are
printed in octal with the bits symbolically decoded.  Any error is
fatal on non-raw tape; when possible the driver will have retried
the operation which failed several times before reporting the error.
.Pp
.It mu%d: blank tape.
An attempt was made to read a blank tape (a tape without even
end-of-file marks).
.Pp
.It mu%d: offline.
During an i/o operation the device was set offline.  If a
non-raw tape was used in the access it is closed.
.El
.Sh SEE ALSO
.Xr mt 1 ,
.Xr tar 1 ,
.Xr tp 1 ,
.Xr mtio 4 ,
.Xr tm 4 ,
.Xr ts 4 ,
.Xr ut 4
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.1 .
.Sh BUGS
If a physical error (non-data) occurs,
.Nm
may hang ungracefully.
.Pp
Because 800
.Tn BPI
tapes are not supported, the numbering of minor devices
is inconsistent with triple-density tape units.
Unit 0 is drive 0, 1600
.Tn BPI.
