.ref-845a45a641b570c4164b05f649aca9a6fdddbe6e/usr/src/share/man/man4/man4.vax/pcl.4
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)pcl.4	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt PCL 4 vax
.Os BSD 4.2
.Sh NAME
.Nm pcl
.Nd
.Tn DEC CSS
.Tn PCL-11 B
Network Interface
.Sh SYNOPSIS
.Cd "device pcl0 at uba? csr 164200 vector pclxint pclrint"
.Sh DESCRIPTION
The 
.Nm pcl
device provides an
.Tn IP Ns -only
interface to the
.Tn DEC CSS
.Tn PCL-11
time division multiplexed network bus.
The controller itself is not accessible to users.
.Pp
The hosts's address is specified with the
.Dv SIOCSIFADDR
.Xr ioctl 2 .
The interface will not transmit or receive any data before
its address is defined.
.Pp
As the
.Tn PCL-11
hardware is only capable of having 15 interfaces per network,
a single-byte host-on-network number is used, with range [1..15] to match
the
.Tn TDM
bus addresses of the interfaces.
.Pp
The interface currently only supports the Internet protocol family
and only provides
.Dq natural
(header) encapsulation.
.Sh DIAGNOSTICS
.Bl -diag
.It pcl%d: can't init.
Insufficient
.Tn UNIBUS
resources existed to initialize the device.
This is likely to occur when the device is run on a buffered
data path on an 11/750 and other network interfaces are also
configured to use buffered data paths, or when it is configured
to use buffered data paths on an 11/730 (which has none).
.Pp
.It pcl%d: can't handle af%d.
The interface was handed a message with addresses formatted in an
unsuitable address family;  the packet was dropped.
.Pp
.It pcl%d: stray xmit interrupt.
An interrupt occurred when no output had previously been started.
.Pp
.It pcl%d: master.
The
.Tn TDM
bus had no station providing ``bus master'' timing signals,
so this interface has assumed the ``master'' role.  This message should
only appear at most once per
.Tn UNIBUS INIT
on a single system.
Unless there is a hardware failure, only one station may be master at at time.
.Pp
.It pcl%d: send error, tcr=%b, tsr=%b.
The device indicated a problem sending data on output.
If a ``receiver offline'' error is detected, it is not normally logged
unless the option
.Dv PCL_TESTING
has been selected, as this causes a lot
of console chatter when sending to a down machine.  However, this option
is quite useful when debugging problems with the
.Tn PCL
interfaces.
.Pp
.It pcl%d: rcv error, rcr=%b rsr=%b.
The device indicated a problem receiving data on input.
.Pp
.It pcl%d: bad len=%d.
An input operation resulted in a data transfer of less than
0 or more than 1008 bytes of
data into memory (according to the word count register).
This should never happen as the maximum size of a
.Tn PCL
message
has been agreed upon to be 1008 bytes (same as ArpaNet message).
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr inet 4
.Sh HISTORY
The
.Nm
interface appeared in
.Bx 4.2 .
