usr/src/usr.sbin/chown/chown.8
.\" Copyright (c) 1990, 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)chown.8	6.5 (Berkeley) %G%
.\"
.Dd 
.Dt CHOWN 8
.Os BSD 4
.Sh NAME
.Nm chown
.Nd change file owner and group
.Sh SYNOPSIS
.Nm chown
.Op Fl Rf
.Op Ar owner
.Op Ar group
.Ar file ...
.Sh DESCRIPTION
.Nm Chown
sets the user ID and/or the group ID of the specified files.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl R
Change the user ID and/or the group ID for the file hierarchies rooted
in the files instead of just the files themselves.
.It Fl f
Don't report any failure to change file owner or group, nor modify
the exit status to reflect such failures.
.El
.Pp
The
.Ar owner
and
.Ar group
operands are both optional, but at least one must be specified; if
the group operand is specified, it must be preceded by a colon (``:'')
character.
.Pp
The
.Ar owner
may be either a numeric user ID or a user name.
If a user name is also a numeric user ID, the operand is used as a
user name.
The
.Ar group
may be either a numeric group ID or a group name.
If a group name is also a numeric group ID, the operand is used as a
group name.
.Pp
The ownership of a file may only be altered by a super-user for
obvious security reasons.
.Pp
The owner and group of symbolic links are themselves changed instead
of the file to which the link points.
.Pp
The
.Nm chown
utility exits 0 on success, and >0 if an error occurs.
.Sh COMPATIBILITY
Previous versions of the
.Nm chown
utility used the dot (``.'') character to distinguish the group name.
This has been changed to be a colon (``:'') character so that user and
group names may contain the dot character.
.Sh SEE ALSO
.Xr chgrp 1 ,
.Xr find 1 ,
.Xr chown 2
.Sh STANDARDS
The
.Nm chown
command is expected to be POSIX 1003.2 compliant.
