.ref-BSD-4_4/usr/src/usr.bin/uucp/uuclean/uuclean.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)uuclean.8	8.1 (Berkeley) 6/6/93
.\"
.Dd June 6, 1993
.Dt UUCLEAN 8
.Os BSD 4.2
.Sh NAME
.Nm uuclean
.Nd uucp spool directory clean-up
.Sh SYNOPSIS
.Nm uuclean
.Op Fl d Ns Ar subdirectory
.Op Fl m
.Op Fl n Ns Ar time
.Op Fl p Ns Ar pre
.Sh DESCRIPTION
.Xr Uuclean
will scan the spool directory for files with the
specified prefix and delete all those which are
older than the specified number of hours.
.Pp
The following options are available.
.Bl -tag -width Ds
.It Fl d Ns Ar subdirectory
Only the specified subdirectory will be cleaned.
.It Fl m
Send mail to the owner of the file
when it is deleted.
.It Fl n Ns Ar time
Files whose age is more than
.Ar time
hours will be deleted if the prefix
test is satisfied.
(default time is 72 hours)
.It Fl p Ns Ar pre
Scan for files with
.Ar pre
as the file prefix.
Up to 10
.Fl p
arguments may be specified.
.El
.Pp
This program will typically be run daily by
.Xr cron 8 .
.Sh FILES
.Bl -tag -width /var/spool/uucp
.It Pa /var/spool/uucp
Spool directory
.El
.Sh SEE ALSO
.Xr uucp 1 ,
.Xr uux 1 ,
.Xr uucico 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
