usr/src/sbin/mount_kernfs/mount_kernfs.8
.\"
.\" Copyright (c) 1992 The Regents of the University of California
.\" Copyright (c) 1990, 1992 Jan-Simon Pendry
.\" All rights reserved.
.\"
.\" This code is derived from software donated to Berkeley by
.\" Jan-Simon Pendry.
.\"
.\" %sccs.include.redist.roff%
.\"
.\"	@(#)mount_kernfs.8	5.1 (Berkeley) %G%
.\"
.\"
.Dd 
.Dt MOUNT_KERNFS 8
.Os BSD 4.4
.Sh NAME
.Nm mount_kernfs
.Nd mount the /kern file system
.Sh SYNOPSIS
.Nm mount_kernfs
.Op Fl F Ar fsoptions
.Pa /kern
.Pa mount_point
.Sh DESCRIPTION
The
.Nm mount_kern
command attaches an instance of the kernel parameter
namespace to the global filesystem namespace.
The conventional mount point is
.Pa /kern .
This command is normally executed by
.Xr mount 8
at boot time.
.Pp
.Sh FILES
.Bl -tag -width copyright\ \- -compact
.It Pa copyright \-
kernel copyright message.
.It Pa hostname \-
the hostname.  The hostname can be changed by writing to this file.
.It Pa hz \-
the frequency of the system clock.
.It Pa loadavg \-
four integers in decimal ASCII representing the 1, 5 and 15 minute
load average in kern fix point format.  The final integer is the fix-point
scaling factor.
.It Pa pagesize \-
the machine pagesize, in decimal ASCII.
.It Pa physmem \-
the number of pages of physical memory in the machine, in decimal ASCII.
.It Pa root \-
the root directory.
.It Pa rootdev \-
the root device.
.It Pa time \-
two integers in decimal ASCII representing the second and microsecond
value of the system clock.
.It Pa version \-
the kernel version string.
.El
.Sh SEE ALSO
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr fstab 5
.Sh CAVEATS
This filesystem may not be NFS-exported.
.Sh HISTORY
The
.Nm
filesystem
is
.Ud
