usr/src/share/man/man8/sticky.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)sticky.8	8.1 (Berkeley) %G%
.\"
.Dd 
.Dt STICKY 8
.Os BSD 4
.Sh NAME
.Nm sticky
.Nd sticky text and append-only directories
.Sh DESCRIPTION
A special file mode, called the
.Em sticky bit
(mode S_ISVTX),
is used to indicate special treatment
for shareable executable files and directories.
See
.Xr chmod 2
or
the file
.Pa /usr/include/sys/stat.h
for an explanation of file modes.
.Sh STICKY TEXT EXECUTABLE FILES
An executable shareable file whose sticky bit is set
will not be immediately discarded from swap space after execution.
The kernel will hoard the text segment of the file for future
reuse and avoid having to reload the program.
Shareable text segments are normally placed
in a least-frequently-used cache after use,
and thus the `sticky bit' has little effect on commonly-used text images.
.Pp
Sharable executable files are created with the
.Fl n
and
.Fl z
options of
the loader
.Xr ld 1 .
.Pp
Only the super-user can set the sticky bit
on a sharable executable file.
.Sh STICKY DIRECTORIES
A directory whose `sticky bit' is set
becomes an append-only directory, or, more accurately,
a directory in which the deletion of files is restricted.
A file in a sticky directory may only be removed or renamed
by a user if the user has write permission for the directory and
the user is the owner of the file, the owner of the directory,
or the super-user.
This feature is usefully applied to directories such as
.Pa /tmp
which must be publicly writable but
should deny users the license to arbitrarily
delete or rename each others' files.
.Pp
Any user may create a sticky directory.
See
.Xr chmod 1
for details about modifying file modes.
.Sh BUGS
Since the text areas of sticky text executables are stashed in the swap area,
abuse of the feature can cause a system to run out of swap.
.Pp
Neither
.Xr open 2
nor
.Xr mkdir 2
will create a file with the sticky bit set.
.Sh HISTORY
A
.Nm
command appeared in Version 32V AT&T UNIX.
