.ref-845a45a641b570c4164b05f649aca9a6fdddbe6e/usr/src/usr.bin/w/w.1
.\" Copyright (c) 1980, 1990, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)w.1	6.9 (Berkeley) %G%
.\"
.Dd 
.Dt W 1
.Os BSD 4
.Sh NAME
.Nm w
.Nd "who present users are and what they are doing"
.Sh SYNOPSIS
.Nm w
.Op Fl hin
.Op Fl M Ar core
.Op Fl N Ar system
.Op Ar user
.Sh DESCRIPTION
The
.Nm w
utility prints a summary of the current activity on the system,
including what each user is doing.
The first line displays the current time of day, how long the system has
been running, the number of users logged into the system, and the load
averages.
The load average numbers give the number of jobs in the run queue averaged
over 1, 5 and 15 minutes.
.Pp
The fields output are the user's login name, the name of the terminal the
user is on, the host from which the user is logged in, the time the user
logged on, the time since the user last typed anything,
and the name and arguments of the current process.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl h
Suppress the heading.
.It Fl i
Output is sorted by idle time.
.It Fl M
Extract values associated with the name list from the specified
core instead of the default
.Dq /dev/kmem .
.It Fl N
Extract the name list from the specified system instead of the
default
.Dq /vmunix .
.It Fl n
Show network addresses as numbers (normally
.Nm w
interprets addresses and attempts to display them symbolically).
.El
.Pp
If a
.Ar user
name is specified, the output is restricted to that user.
.Sh FILES
.Bl -tag -width /var/run/utmp -compact
.It Pa /var/run/utmp
list of users on the system
.El
.Sh SEE ALSO
.Xr who 1 ,
.Xr finger 1 ,
.Xr ps 1 ,
.Xr uptime 1 ,
.Sh BUGS
The notion of the
.Dq current process
is muddy.
The current algorithm is ``the highest numbered process on the terminal
that is not ignoring interrupts, or, if there is none, the highest numbered
process on the terminal''.
This fails, for example, in critical sections of programs like the shell
and editor, or when faulty programs running in the background fork and fail
to ignore interrupts.
(In cases where no process can be found,
.Nm w
prints
.Dq \- . )
.Pp
The
.Tn CPU
time is only an estimate, in particular, if someone leaves a background
process running after logging out, the person currently on that terminal is
.Dq charged
with the time.
.Pp
Background processes are not shown, even though they account for
much of the load on the system.
.Pp
Sometimes processes, typically those in the background, are printed with
null or garbaged arguments.
In these cases, the name of the command is printed in parentheses.
.Pp
The 
.Nm w
utility does not know about the new conventions for detection of background
jobs.
It will sometimes find a background job instead of the right one.
.Sh COMPATIBILITY
The
.Fl f ,
.Fl l ,
.Fl s ,
and
.Fl w
flags are no longer supported.
.Sh HISTORY
The
.Nm
command appeared in
.Ux 3.0 .
